MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile RPINR32_33bits_t RPINR32_33bits __at(0xE3A);
// bitfield macros
#define _RPINR32_33_CCP4R_POSN                              0x0
#define _RPINR32_33_CCP4R_POSITION                          0x0
#define _RPINR32_33_CCP4R_SIZE                              0x4
#define _RPINR32_33_CCP4R_LENGTH                            0x4
#define _RPINR32_33_CCP4R_MASK                              0xF
#define _RPINR32_33_CCP5R_POSN                              0x4
#define _RPINR32_33_CCP5R_POSITION                          0x4
#define _RPINR32_33_CCP5R_SIZE                              0x4
#define _RPINR32_33_CCP5R_LENGTH                            0x4
#define _RPINR32_33_CCP5R_MASK                              0xF0
#define _RPINR32_33_CCP4R0_POSN                             0x0
#define _RPINR32_33_CCP4R0_POSITION                         0x0
#define _RPINR32_33_CCP4R0_SIZE                             0x1
#define _RPINR32_33_CCP4R0_LENGTH                           0x1
#define _RPINR32_33_CCP4R0_MASK                             0x1
#define _RPINR32_33_CCP4R1_POSN                             0x1
#define _RPINR32_33_CCP4R1_POSITION                         0x1
#define _RPINR32_33_CCP4R1_SIZE                             0x1
#define _RPINR32_33_CCP4R1_LENGTH                           0x1
#define _RPINR32_33_CCP4R1_MASK                             0x2
#define _RPINR32_33_CCP4R2_POSN                             0x2
#define _RPINR32_33_CCP4R2_POSITION                         0x2
#define _RPINR32_33_CCP4R2_SIZE                             0x1
#define _RPINR32_33_CCP4R2_LENGTH                           0x1
#define _RPINR32_33_CCP4R2_MASK                             0x4
#define _RPINR32_33_CCP4R3_POSN                             0x3
#define _RPINR32_33_CCP4R3_POSITION                         0x3
#define _RPINR32_33_CCP4R3_SIZE                             0x1
#define _RPINR32_33_CCP4R3_LENGTH                           0x1
#define _RPINR32_33_CCP4R3_MASK                             0x8
#define _RPINR32_33_CCP5R0_POSN                             0x4
#define _RPINR32_33_CCP5R0_POSITION                         0x4
#define _RPINR32_33_CCP5R0_SIZE                             0x1
#define _RPINR32_33_CCP5R0_LENGTH                           0x1
#define _RPINR32_33_CCP5R0_MASK                             0x10
#define _RPINR32_33_CCP5R1_POSN                             0x5
#define _RPINR32_33_CCP5R1_POSITION                         0x5
#define _RPINR32_33_CCP5R1_SIZE                             0x1
#define _RPINR32_33_CCP5R1_LENGTH                           0x1
#define _RPINR32_33_CCP5R1_MASK                             0x20
#define _RPINR32_33_CCP5R2_POSN                             0x6
#define _RPINR32_33_CCP5R2_POSITION                         0x6
#define _RPINR32_33_CCP5R2_SIZE                             0x1
#define _RPINR32_33_CCP5R2_LENGTH                           0x1
#define _RPINR32_33_CCP5R2_MASK                             0x40
#define _RPINR32_33_CCP5R3_POSN                             0x7
#define _RPINR32_33_CCP5R3_POSITION                         0x7
#define _RPINR32_33_CCP5R3_SIZE                             0x1
#define _RPINR32_33_CCP5R3_LENGTH                           0x1
#define _RPINR32_33_CCP5R3_MASK                             0x80

// Register: RPINR34_35
#define RPINR34_35 RPINR34_35
extern volatile unsigned char           RPINR34_35          __at(0xE3B);
#ifndef _LIB_BUILD
asm("RPINR34_35 equ 0E3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP6R                  :4;
        unsigned CCP7R                  :4;
    };
    struct {
        unsigned CCP6R0                 :1;
        unsigned CCP6R1                 :1;
        unsigned CCP6R2                 :1;
        unsigned CCP6R3                 :1;
        unsigned CCP7R0                 :1;
        unsigned CCP7R1                 :1;
        unsigned CCP7R2                 :1;
        unsigned CCP7R3                 :1;
    };
} RPINR34_35bits_t;
extern volatile RPINR34_35bits_t RPINR34_35bits __at(0xE3B);
// bitfield macros
#define _RPINR34_35_CCP6R_POSN                              0x0
#define _RPINR34_35_CCP6R_POSITION                          0x0
#define _RPINR34_35_CCP6R_SIZE                              0x4
#define _RPINR34_35_CCP6R_LENGTH                            0x4
#define _RPINR34_35_CCP6R_MASK                              0xF
#define _RPINR34_35_CCP7R_POSN                              0x4
#define _RPINR34_35_CCP7R_POSITION                          0x4
#define _RPINR34_35_CCP7R_SIZE                              0x4
#define _RPINR34_35_CCP7R_LENGTH                            0x4
#define _RPINR34_35_CCP7R_MASK                              0xF0
#define _RPINR34_35_CCP6R0_POSN                             0x0
#define _RPINR34_35_CCP6R0_POSITION                         0x0
#define _RPINR34_35_CCP6R0_SIZE                             0x1
#define _RPINR34_35_CCP6R0_LENGTH                           0x1
#define _RPINR34_35_CCP6R0_MASK                             0x1
#define _RPINR34_35_CCP6R1_POSN                             0x1
#define _RPINR34_35_CCP6R1_POSITION                         0x1
#define _RPINR34_35_CCP6R1_SIZE                             0x1
#define _RPINR34_35_CCP6R1_LENGTH                           0x1
#define _RPINR34_35_CCP6R1_MASK                             0x2
#define _RPINR34_35_CCP6R2_POSN                             0x2
#define _RPINR34_35_CCP6R2_POSITION                         0x2
#define _RPINR34_35_CCP6R2_SIZE                             0x1
#define _RPINR34_35_CCP6R2_LENGTH                           0x1
#define _RPINR34_35_CCP6R2_MASK                             0x4
#define _RPINR34_35_CCP6R3_POSN                             0x3
#define _RPINR34_35_CCP6R3_POSITION                         0x3
#define _RPINR34_35_CCP6R3_SIZE                             0x1
#define _RPINR34_35_CCP6R3_LENGTH                           0x1
#define _RPINR34_35_CCP6R3_MASK                             0x8
#define _RPINR34_35_CCP7R0_POSN                             0x4
#define _RPINR34_35_CCP7R0_POSITION                         0x4
#define _RPINR34_35_CCP7R0_SIZE                             0x1
#define _RPINR34_35_CCP7R0_LENGTH                           0x1
#define _RPINR34_35_CCP7R0_MASK                             0x10
#define _RPINR34_35_CCP7R1_POSN                             0x5
#define _RPINR34_35_CCP7R1_POSITION                         0x5
#define _RPINR34_35_CCP7R1_SIZE                             0x1
#define _RPINR34_35_CCP7R1_LENGTH                           0x1
#define _RPINR34_35_CCP7R1_MASK                             0x20
#define _RPINR34_35_CCP7R2_POSN                             0x6
#define _RPINR34_35_CCP7R2_POSITION                         0x6
#define _RPINR34_35_CCP7R2_SIZE                             0x1
#define _RPINR34_35_CCP7R2_LENGTH                           0x1
#define _RPINR34_35_CCP7R2_MASK                             0x40
#define _RPINR34_35_CCP7R3_POSN                             0x7
#define _RPINR34_35_CCP7R3_POSITION                         0x7
#define _RPINR34_35_CCP7R3_SIZE                             0x1
#define _RPINR34_35_CCP7R3_LENGTH                           0x1
#define _RPINR34_35_CCP7R3_MASK                             0x80

