MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile ADCHIT1Lbits_t ADCHIT1Lbits __at(0xE80);
// bitfield macros
#define _ADCHIT1L_CHH_POSN                                  0x0
#define _ADCHIT1L_CHH_POSITION                              0x0
#define _ADCHIT1L_CHH_SIZE                                  0x8
#define _ADCHIT1L_CHH_LENGTH                                0x8
#define _ADCHIT1L_CHH_MASK                                  0xFF
#define _ADCHIT1L_CHH16_POSN                                0x0
#define _ADCHIT1L_CHH16_POSITION                            0x0
#define _ADCHIT1L_CHH16_SIZE                                0x1
#define _ADCHIT1L_CHH16_LENGTH                              0x1
#define _ADCHIT1L_CHH16_MASK                                0x1
#define _ADCHIT1L_CHH17_POSN                                0x1
#define _ADCHIT1L_CHH17_POSITION                            0x1
#define _ADCHIT1L_CHH17_SIZE                                0x1
#define _ADCHIT1L_CHH17_LENGTH                              0x1
#define _ADCHIT1L_CHH17_MASK                                0x2
#define _ADCHIT1L_CHH18_POSN                                0x2
#define _ADCHIT1L_CHH18_POSITION                            0x2
#define _ADCHIT1L_CHH18_SIZE                                0x1
#define _ADCHIT1L_CHH18_LENGTH                              0x1
#define _ADCHIT1L_CHH18_MASK                                0x4
#define _ADCHIT1L_CHH19_POSN                                0x3
#define _ADCHIT1L_CHH19_POSITION                            0x3
#define _ADCHIT1L_CHH19_SIZE                                0x1
#define _ADCHIT1L_CHH19_LENGTH                              0x1
#define _ADCHIT1L_CHH19_MASK                                0x8
#define _ADCHIT1L_CHH20_POSN                                0x4
#define _ADCHIT1L_CHH20_POSITION                            0x4
#define _ADCHIT1L_CHH20_SIZE                                0x1
#define _ADCHIT1L_CHH20_LENGTH                              0x1
#define _ADCHIT1L_CHH20_MASK                                0x10
#define _ADCHIT1L_CHH21_POSN                                0x5
#define _ADCHIT1L_CHH21_POSITION                            0x5
#define _ADCHIT1L_CHH21_SIZE                                0x1
#define _ADCHIT1L_CHH21_LENGTH                              0x1
#define _ADCHIT1L_CHH21_MASK                                0x20
#define _ADCHIT1L_CHH22_POSN                                0x6
#define _ADCHIT1L_CHH22_POSITION                            0x6
#define _ADCHIT1L_CHH22_SIZE                                0x1
#define _ADCHIT1L_CHH22_LENGTH                              0x1
#define _ADCHIT1L_CHH22_MASK                                0x40
#define _ADCHIT1L_CHH23_POSN                                0x7
#define _ADCHIT1L_CHH23_POSITION                            0x7
#define _ADCHIT1L_CHH23_SIZE                                0x1
#define _ADCHIT1L_CHH23_LENGTH                              0x1
#define _ADCHIT1L_CHH23_MASK                                0x80

// Register: ADCHIT1H
#define ADCHIT1H ADCHIT1H
extern volatile unsigned char           ADCHIT1H            __at(0xE81);
#ifndef _LIB_BUILD
asm("ADCHIT1H equ 0E81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CHH                    :8;
    };
    struct {
        unsigned CHH24                  :1;
        unsigned CHH25                  :1;
        unsigned CHH26                  :1;
        unsigned CHH27                  :1;
        unsigned CHH28                  :1;
        unsigned CHH29                  :1;
        unsigned CHH30                  :1;
    };
} ADCHIT1Hbits_t;
extern volatile ADCHIT1Hbits_t ADCHIT1Hbits __at(0xE81);
// bitfield macros
#define _ADCHIT1H_CHH_POSN                                  0x0
#define _ADCHIT1H_CHH_POSITION                              0x0
#define _ADCHIT1H_CHH_SIZE                                  0x8
#define _ADCHIT1H_CHH_LENGTH                                0x8
#define _ADCHIT1H_CHH_MASK                                  0xFF
#define _ADCHIT1H_CHH24_POSN                                0x0
#define _ADCHIT1H_CHH24_POSITION                            0x0
#define _ADCHIT1H_CHH24_SIZE                                0x1
#define _ADCHIT1H_CHH24_LENGTH                              0x1
#define _ADCHIT1H_CHH24_MASK                                0x1
#define _ADCHIT1H_CHH25_POSN                                0x1
#define _ADCHIT1H_CHH25_POSITION                            0x1
#define _ADCHIT1H_CHH25_SIZE                                0x1
#define _ADCHIT1H_CHH25_LENGTH                              0x1
#define _ADCHIT1H_CHH25_MASK                                0x2
#define _ADCHIT1H_CHH26_POSN                                0x2
#define _ADCHIT1H_CHH26_POSITION                            0x2
#define _ADCHIT1H_CHH26_SIZE                                0x1
#define _ADCHIT1H_CHH26_LENGTH                              0x1
#define _ADCHIT1H_CHH26_MASK                                0x4
#define _ADCHIT1H_CHH27_POSN                                0x3
#define _ADCHIT1H_CHH27_POSITION                            0x3
#define _ADCHIT1H_CHH27_SIZE                                0x1
#define _ADCHIT1H_CHH27_LENGTH                              0x1
#define _ADCHIT1H_CHH27_MASK                                0x8
#define _ADCHIT1H_CHH28_POSN                                0x4
#define _ADCHIT1H_CHH28_POSITION                            0x4
#define _ADCHIT1H_CHH28_SIZE                                0x1
#define _ADCHIT1H_CHH28_LENGTH                              0x1
#define _ADCHIT1H_CHH28_MASK                                0x10
#define _ADCHIT1H_CHH29_POSN                                0x5
#define _ADCHIT1H_CHH29_POSITION                            0x5
#define _ADCHIT1H_CHH29_SIZE                                0x1
#define _ADCHIT1H_CHH29_LENGTH                              0x1
#define _ADCHIT1H_CHH29_MASK                                0x20
#define _ADCHIT1H_CHH30_POSN                                0x6
#define _ADCHIT1H_CHH30_POSITION                            0x6
#define _ADCHIT1H_CHH30_SIZE                                0x1
#define _ADCHIT1H_CHH30_LENGTH                              0x1
#define _ADCHIT1H_CHH30_MASK                                0x40

// Register: ADCSS0L
#define ADCSS0L ADCSS0L
extern volatile unsigned char           ADCSS0L             __at(0xE82);
#ifndef _LIB_BUILD
asm("ADCSS0L equ 0E82h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSS                    :8;
    };
    struct {
        unsigned CSS0                   :1;
        unsigned CSS1                   :1;
        unsigned CSS2                   :1;
        unsigned CSS3                   :1;
        unsigned CSS4                   :1;
        unsigned CSS5                   :1;
        unsigned CSS6                   :1;
        unsigned CSS7                   :1;
    };
} ADCSS0Lbits_t;
extern volatile ADCSS0Lbits_t ADCSS0Lbits __at(0xE82);
// bitfield macros
#define _ADCSS0L_CSS_POSN                                   0x0
#define _ADCSS0L_CSS_POSITION                               0x0
#define _ADCSS0L_CSS_SIZE                                   0x8
#define _ADCSS0L_CSS_LENGTH                                 0x8
#define _ADCSS0L_CSS_MASK                                   0xFF
#define _ADCSS0L_CSS0_POSN                                  0x0
#define _ADCSS0L_CSS0_POSITION                              0x0
#define _ADCSS0L_CSS0_SIZE                                  0x1
#define _ADCSS0L_CSS0_LENGTH                                0x1
#define _ADCSS0L_CSS0_MASK                                  0x1
#define _ADCSS0L_CSS1_POSN                                  0x1
#define _ADCSS0L_CSS1_POSITION                              0x1
#define _ADCSS0L_CSS1_SIZE                                  0x1
#define _ADCSS0L_CSS1_LENGTH                                0x1
#define _ADCSS0L_CSS1_MASK                                  0x2
#define _ADCSS0L_CSS2_POSN                                  0x2
#define _ADCSS0L_CSS2_POSITION                              0x2
#define _ADCSS0L_CSS2_SIZE                                  0x1
#define _ADCSS0L_CSS2_LENGTH                                0x1
#define _ADCSS0L_CSS2_MASK                                  0x4
#define _ADCSS0L_CSS3_POSN                                  0x3
#define _ADCSS0L_CSS3_POSITION                              0x3
#define _ADCSS0L_CSS3_SIZE                                  0x1
#define _ADCSS0L_CSS3_LENGTH                                0x1
#define _ADCSS0L_CSS3_MASK                                  0x8
#define _ADCSS0L_CSS4_POSN                                  0x4
#define _ADCSS0L_CSS4_POSITION                              0x4
#define _ADCSS0L_CSS4_SIZE                                  0x1
#define _ADCSS0L_CSS4_LENGTH                                0x1
#define _ADCSS0L_CSS4_MASK                                  0x10
#define _ADCSS0L_CSS5_POSN                                  0x5
#define _ADCSS0L_CSS5_POSITION                              0x5
#define _ADCSS0L_CSS5_SIZE                                  0x1
#define _ADCSS0L_CSS5_LENGTH                                0x1
#define _ADCSS0L_CSS5_MASK                                  0x20
#define _ADCSS0L_CSS6_POSN                                  0x6
#define _ADCSS0L_CSS6_POSITION                              0x6
#define _ADCSS0L_CSS6_SIZE                                  0x1
#define _ADCSS0L_CSS6_LENGTH                                0x1
#define _ADCSS0L_CSS6_MASK                                  0x40
#define _ADCSS0L_CSS7_POSN                                  0x7
#define _ADCSS0L_CSS7_POSITION                              0x7
#define _ADCSS0L_CSS7_SIZE                                  0x1
#define _ADCSS0L_CSS7_LENGTH                                0x1
#define _ADCSS0L_CSS7_MASK                                  0x80

