MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile LCDDATA8bits_t LCDDATA8bits __at(0xE96);
// bitfield macros
#define _LCDDATA8_S00C1_POSN                                0x0
#define _LCDDATA8_S00C1_POSITION                            0x0
#define _LCDDATA8_S00C1_SIZE                                0x1
#define _LCDDATA8_S00C1_LENGTH                              0x1
#define _LCDDATA8_S00C1_MASK                                0x1
#define _LCDDATA8_S01C1_POSN                                0x1
#define _LCDDATA8_S01C1_POSITION                            0x1
#define _LCDDATA8_S01C1_SIZE                                0x1
#define _LCDDATA8_S01C1_LENGTH                              0x1
#define _LCDDATA8_S01C1_MASK                                0x2
#define _LCDDATA8_S02C1_POSN                                0x2
#define _LCDDATA8_S02C1_POSITION                            0x2
#define _LCDDATA8_S02C1_SIZE                                0x1
#define _LCDDATA8_S02C1_LENGTH                              0x1
#define _LCDDATA8_S02C1_MASK                                0x4
#define _LCDDATA8_S03C1_POSN                                0x3
#define _LCDDATA8_S03C1_POSITION                            0x3
#define _LCDDATA8_S03C1_SIZE                                0x1
#define _LCDDATA8_S03C1_LENGTH                              0x1
#define _LCDDATA8_S03C1_MASK                                0x8
#define _LCDDATA8_S04C1_POSN                                0x4
#define _LCDDATA8_S04C1_POSITION                            0x4
#define _LCDDATA8_S04C1_SIZE                                0x1
#define _LCDDATA8_S04C1_LENGTH                              0x1
#define _LCDDATA8_S04C1_MASK                                0x10
#define _LCDDATA8_S05C1_POSN                                0x5
#define _LCDDATA8_S05C1_POSITION                            0x5
#define _LCDDATA8_S05C1_SIZE                                0x1
#define _LCDDATA8_S05C1_LENGTH                              0x1
#define _LCDDATA8_S05C1_MASK                                0x20
#define _LCDDATA8_S06C1_POSN                                0x6
#define _LCDDATA8_S06C1_POSITION                            0x6
#define _LCDDATA8_S06C1_SIZE                                0x1
#define _LCDDATA8_S06C1_LENGTH                              0x1
#define _LCDDATA8_S06C1_MASK                                0x40
#define _LCDDATA8_S07C1_POSN                                0x7
#define _LCDDATA8_S07C1_POSITION                            0x7
#define _LCDDATA8_S07C1_SIZE                                0x1
#define _LCDDATA8_S07C1_LENGTH                              0x1
#define _LCDDATA8_S07C1_MASK                                0x80

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
extern volatile unsigned char           LCDDATA9            __at(0xE97);
#ifndef _LIB_BUILD
asm("LCDDATA9 equ 0E97h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C1                  :1;
        unsigned S09C1                  :1;
        unsigned S10C1                  :1;
        unsigned S11C1                  :1;
        unsigned S12C1                  :1;
        unsigned S13C1                  :1;
        unsigned S14C1                  :1;
        unsigned S15C1                  :1;
    };
} LCDDATA9bits_t;
extern volatile LCDDATA9bits_t LCDDATA9bits __at(0xE97);
// bitfield macros
#define _LCDDATA9_S08C1_POSN                                0x0
#define _LCDDATA9_S08C1_POSITION                            0x0
#define _LCDDATA9_S08C1_SIZE                                0x1
#define _LCDDATA9_S08C1_LENGTH                              0x1
#define _LCDDATA9_S08C1_MASK                                0x1
#define _LCDDATA9_S09C1_POSN                                0x1
#define _LCDDATA9_S09C1_POSITION                            0x1
#define _LCDDATA9_S09C1_SIZE                                0x1
#define _LCDDATA9_S09C1_LENGTH                              0x1
#define _LCDDATA9_S09C1_MASK                                0x2
#define _LCDDATA9_S10C1_POSN                                0x2
#define _LCDDATA9_S10C1_POSITION                            0x2
#define _LCDDATA9_S10C1_SIZE                                0x1
#define _LCDDATA9_S10C1_LENGTH                              0x1
#define _LCDDATA9_S10C1_MASK                                0x4
#define _LCDDATA9_S11C1_POSN                                0x3
#define _LCDDATA9_S11C1_POSITION                            0x3
#define _LCDDATA9_S11C1_SIZE                                0x1
#define _LCDDATA9_S11C1_LENGTH                              0x1
#define _LCDDATA9_S11C1_MASK                                0x8
#define _LCDDATA9_S12C1_POSN                                0x4
#define _LCDDATA9_S12C1_POSITION                            0x4
#define _LCDDATA9_S12C1_SIZE                                0x1
#define _LCDDATA9_S12C1_LENGTH                              0x1
#define _LCDDATA9_S12C1_MASK                                0x10
#define _LCDDATA9_S13C1_POSN                                0x5
#define _LCDDATA9_S13C1_POSITION                            0x5
#define _LCDDATA9_S13C1_SIZE                                0x1
#define _LCDDATA9_S13C1_LENGTH                              0x1
#define _LCDDATA9_S13C1_MASK                                0x20
#define _LCDDATA9_S14C1_POSN                                0x6
#define _LCDDATA9_S14C1_POSITION                            0x6
#define _LCDDATA9_S14C1_SIZE                                0x1
#define _LCDDATA9_S14C1_LENGTH                              0x1
#define _LCDDATA9_S14C1_MASK                                0x40
#define _LCDDATA9_S15C1_POSN                                0x7
#define _LCDDATA9_S15C1_POSITION                            0x7
#define _LCDDATA9_S15C1_SIZE                                0x1
#define _LCDDATA9_S15C1_LENGTH                              0x1
#define _LCDDATA9_S15C1_MASK                                0x80

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
extern volatile unsigned char           LCDDATA10           __at(0xE98);
#ifndef _LIB_BUILD
asm("LCDDATA10 equ 0E98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C1                  :1;
        unsigned S17C1                  :1;
        unsigned S18C1                  :1;
        unsigned S19C1                  :1;
        unsigned S20C1                  :1;
        unsigned S21C1                  :1;
        unsigned S22C1                  :1;
        unsigned S23C1                  :1;
    };
} LCDDATA10bits_t;
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0xE98);
// bitfield macros
#define _LCDDATA10_S16C1_POSN                               0x0
#define _LCDDATA10_S16C1_POSITION                           0x0
#define _LCDDATA10_S16C1_SIZE                               0x1
#define _LCDDATA10_S16C1_LENGTH                             0x1
#define _LCDDATA10_S16C1_MASK                               0x1
#define _LCDDATA10_S17C1_POSN                               0x1
#define _LCDDATA10_S17C1_POSITION                           0x1
#define _LCDDATA10_S17C1_SIZE                               0x1
#define _LCDDATA10_S17C1_LENGTH                             0x1
#define _LCDDATA10_S17C1_MASK                               0x2
#define _LCDDATA10_S18C1_POSN                               0x2
#define _LCDDATA10_S18C1_POSITION                           0x2
#define _LCDDATA10_S18C1_SIZE                               0x1
#define _LCDDATA10_S18C1_LENGTH                             0x1
#define _LCDDATA10_S18C1_MASK                               0x4
#define _LCDDATA10_S19C1_POSN                               0x3
#define _LCDDATA10_S19C1_POSITION                           0x3
#define _LCDDATA10_S19C1_SIZE                               0x1
#define _LCDDATA10_S19C1_LENGTH                             0x1
#define _LCDDATA10_S19C1_MASK                               0x8
#define _LCDDATA10_S20C1_POSN                               0x4
#define _LCDDATA10_S20C1_POSITION                           0x4
#define _LCDDATA10_S20C1_SIZE                               0x1
#define _LCDDATA10_S20C1_LENGTH                             0x1
#define _LCDDATA10_S20C1_MASK                               0x10
#define _LCDDATA10_S21C1_POSN                               0x5
#define _LCDDATA10_S21C1_POSITION                           0x5
#define _LCDDATA10_S21C1_SIZE                               0x1
#define _LCDDATA10_S21C1_LENGTH                             0x1
#define _LCDDATA10_S21C1_MASK                               0x20
#define _LCDDATA10_S22C1_POSN                               0x6
#define _LCDDATA10_S22C1_POSITION                           0x6
#define _LCDDATA10_S22C1_SIZE                               0x1
#define _LCDDATA10_S22C1_LENGTH                             0x1
#define _LCDDATA10_S22C1_MASK                               0x40
#define _LCDDATA10_S23C1_POSN                               0x7
#define _LCDDATA10_S23C1_POSITION                           0x7
#define _LCDDATA10_S23C1_SIZE                               0x1
#define _LCDDATA10_S23C1_LENGTH                             0x1
#define _LCDDATA10_S23C1_MASK                               0x80

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0xE99);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 0E99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C1                  :1;
        unsigned S25C1                  :1;
        unsigned S26C1                  :1;
        unsigned S27C1                  :1;
        unsigned S28C1                  :1;
        unsigned S29C1                  :1;
        unsigned S30C1                  :1;
        unsigned S31C1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned ADMSK1                 :1;
        unsigned ADMSK2                 :1;
        unsigned ADMSK3                 :1;
        unsigned ADMSK4                 :1;
        unsigned ADMSK5                 :1;
    };
} LCDDATA11bits_t;
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0xE99);
// bitfield macros
#define _LCDDATA11_S24C1_POSN                               0x0
#define _LCDDATA11_S24C1_POSITION                           0x0
#define _LCDDATA11_S24C1_SIZE                               0x1
#define _LCDDATA11_S24C1_LENGTH                             0x1
#define _LCDDATA11_S24C1_MASK                               0x1
#define _LCDDATA11_S25C1_POSN                               0x1
#define _LCDDATA11_S25C1_POSITION                           0x1
#define _LCDDATA11_S25C1_SIZE                               0x1
#define _LCDDATA11_S25C1_LENGTH                             0x1
#define _LCDDATA11_S25C1_MASK                               0x2
#define _LCDDATA11_S26C1_POSN                               0x2
#define _LCDDATA11_S26C1_POSITION                           0x2
#define _LCDDATA11_S26C1_SIZE                               0x1
#define _LCDDATA11_S26C1_LENGTH                             0x1
#define _LCDDATA11_S26C1_MASK                               0x4
#define _LCDDATA11_S27C1_POSN                               0x3
#define _LCDDATA11_S27C1_POSITION                           0x3
#define _LCDDATA11_S27C1_SIZE                               0x1
#define _LCDDATA11_S27C1_LENGTH                             0x1
#define _LCDDATA11_S27C1_MASK                               0x8
#define _LCDDATA11_S28C1_POSN                               0x4
#define _LCDDATA11_S28C1_POSITION                           0x4
#define _LCDDATA11_S28C1_SIZE                               0x1
#define _LCDDATA11_S28C1_LENGTH                             0x1
#define _LCDDATA11_S28C1_MASK                               0x10
#define _LCDDATA11_S29C1_POSN                               0x5
#define _LCDDATA11_S29C1_POSITION                           0x5
#define _LCDDATA11_S29C1_SIZE                               0x1
#define _LCDDATA11_S29C1_LENGTH                             0x1
#define _LCDDATA11_S29C1_MASK                               0x20
#define _LCDDATA11_S30C1_POSN                               0x6
#define _LCDDATA11_S30C1_POSITION                           0x6
#define _LCDDATA11_S30C1_SIZE                               0x1
#define _LCDDATA11_S30C1_LENGTH                             0x1
#define _LCDDATA11_S30C1_MASK                               0x40
#define _LCDDATA11_S31C1_POSN                               0x7
#define _LCDDATA11_S31C1_POSITION                           0x7
#define _LCDDATA11_S31C1_SIZE                               0x1
#define _LCDDATA11_S31C1_LENGTH                             0x1
#define _LCDDATA11_S31C1_MASK                               0x80
#define _LCDDATA11_ADMSK1_POSN                              0x1
#define _LCDDATA11_ADMSK1_POSITION                          0x1
#define _LCDDATA11_ADMSK1_SIZE                              0x1
#define _LCDDATA11_ADMSK1_LENGTH                            0x1
#define _LCDDATA11_ADMSK1_MASK                              0x2
#define _LCDDATA11_ADMSK2_POSN                              0x2
#define _LCDDATA11_ADMSK2_POSITION                          0x2
#define _LCDDATA11_ADMSK2_SIZE                              0x1
#define _LCDDATA11_ADMSK2_LENGTH                            0x1
#define _LCDDATA11_ADMSK2_MASK                              0x4
#define _LCDDATA11_ADMSK3_POSN                              0x3
#define _LCDDATA11_ADMSK3_POSITION                          0x3
#define _LCDDATA11_ADMSK3_SIZE                              0x1
#define _LCDDATA11_ADMSK3_LENGTH                            0x1
#define _LCDDATA11_ADMSK3_MASK                              0x8
#define _LCDDATA11_ADMSK4_POSN                              0x4
#define _LCDDATA11_ADMSK4_POSITION                          0x4
#define _LCDDATA11_ADMSK4_SIZE                              0x1
#define _LCDDATA11_ADMSK4_LENGTH                            0x1
#define _LCDDATA11_ADMSK4_MASK                              0x10
#define _LCDDATA11_ADMSK5_POSN                              0x5
#define _LCDDATA11_ADMSK5_POSITION                          0x5
#define _LCDDATA11_ADMSK5_SIZE                              0x1
#define _LCDDATA11_ADMSK5_LENGTH                            0x1
#define _LCDDATA11_ADMSK5_MASK                              0x20

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0xE9A);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 0E9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C1                  :1;
        unsigned S33C1                  :1;
        unsigned S34C1                  :1;
        unsigned S35C1                  :1;
        unsigned S36C1                  :1;
        unsigned S37C1                  :1;
        unsigned S38C1                  :1;
        unsigned S39C1                  :1;
    };
    struct {
        unsigned SSPM012                :1;
        unsigned SSPM112                :1;
        unsigned SSPM212                :1;
        unsigned SSPM312                :1;
    };
} LCDDATA12bits_t;
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0xE9A);
// bitfield macros
#define _LCDDATA12_S32C1_POSN                               0x0
#define _LCDDATA12_S32C1_POSITION                           0x0
#define _LCDDATA12_S32C1_SIZE                               0x1
#define _LCDDATA12_S32C1_LENGTH                             0x1
#define _LCDDATA12_S32C1_MASK                               0x1
#define _LCDDATA12_S33C1_POSN                               0x1
#define _LCDDATA12_S33C1_POSITION                           0x1
#define _LCDDATA12_S33C1_SIZE                               0x1
#define _LCDDATA12_S33C1_LENGTH                             0x1
#define _LCDDATA12_S33C1_MASK                               0x2
#define _LCDDATA12_S34C1_POSN                               0x2
#define _LCDDATA12_S34C1_POSITION                           0x2
#define _LCDDATA12_S34C1_SIZE                               0x1
#define _LCDDATA12_S34C1_LENGTH                             0x1
#define _LCDDATA12_S34C1_MASK                               0x4
#define _LCDDATA12_S35C1_POSN                               0x3
#define _LCDDATA12_S35C1_POSITION                           0x3
#define _LCDDATA12_S35C1_SIZE                               0x1
#define _LCDDATA12_S35C1_LENGTH                             0x1
#define _LCDDATA12_S35C1_MASK                               0x8
#define _LCDDATA12_S36C1_POSN                               0x4
#define _LCDDATA12_S36C1_POSITION                           0x4
#define _LCDDATA12_S36C1_SIZE                               0x1
#define _LCDDATA12_S36C1_LENGTH                             0x1
#define _LCDDATA12_S36C1_MASK                               0x10
#define _LCDDATA12_S37C1_POSN                               0x5
#define _LCDDATA12_S37C1_POSITION                           0x5
#define _LCDDATA12_S37C1_SIZE                               0x1
#define _LCDDATA12_S37C1_LENGTH                             0x1
#define _LCDDATA12_S37C1_MASK                               0x20
#define _LCDDATA12_S38C1_POSN                               0x6
#define _LCDDATA12_S38C1_POSITION                           0x6
#define _LCDDATA12_S38C1_SIZE                               0x1
#define _LCDDATA12_S38C1_LENGTH                             0x1
#define _LCDDATA12_S38C1_MASK                               0x40
#define _LCDDATA12_S39C1_POSN                               0x7
#define _LCDDATA12_S39C1_POSITION                           0x7
#define _LCDDATA12_S39C1_SIZE                               0x1
#define _LCDDATA12_S39C1_LENGTH                             0x1
#define _LCDDATA12_S39C1_MASK                               0x80
#define _LCDDATA12_SSPM012_POSN                             0x0
#define _LCDDATA12_SSPM012_POSITION                         0x0
#define _LCDDATA12_SSPM012_SIZE                             0x1
#define _LCDDATA12_SSPM012_LENGTH                           0x1
#define _LCDDATA12_SSPM012_MASK                             0x1
#define _LCDDATA12_SSPM112_POSN                             0x1
#define _LCDDATA12_SSPM112_POSITION                         0x1
#define _LCDDATA12_SSPM112_SIZE                             0x1
#define _LCDDATA12_SSPM112_LENGTH                           0x1
#define _LCDDATA12_SSPM112_MASK                             0x2
#define _LCDDATA12_SSPM212_POSN                             0x2
#define _LCDDATA12_SSPM212_POSITION                         0x2
#define _LCDDATA12_SSPM212_SIZE                             0x1
#define _LCDDATA12_SSPM212_LENGTH                           0x1
#define _LCDDATA12_SSPM212_MASK                             0x4
#define _LCDDATA12_SSPM312_POSN                             0x3
#define _LCDDATA12_SSPM312_POSITION                         0x3
#define _LCDDATA12_SSPM312_SIZE                             0x1
#define _LCDDATA12_SSPM312_LENGTH                           0x1
#define _LCDDATA12_SSPM312_MASK                             0x8

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
extern volatile unsigned char           LCDDATA13           __at(0xE9B);
#ifndef _LIB_BUILD
asm("LCDDATA13 equ 0E9Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C1                  :1;
        unsigned S41C1                  :1;
        unsigned S42C1                  :1;
        unsigned S43C1                  :1;
        unsigned S44C1                  :1;
        unsigned S45C1                  :1;
        unsigned S46C1                  :1;
        unsigned S47C1                  :1;
    };
} LCDDATA13bits_t;
extern volatile LCDDATA13bits_t LCDDATA13bits __at(0xE9B);
// bitfield macros
#define _LCDDATA13_S40C1_POSN                               0x0
#define _LCDDATA13_S40C1_POSITION                           0x0
#define _LCDDATA13_S40C1_SIZE                               0x1
#define _LCDDATA13_S40C1_LENGTH                             0x1
#define _LCDDATA13_S40C1_MASK                               0x1
#define _LCDDATA13_S41C1_POSN                               0x1
#define _LCDDATA13_S41C1_POSITION                           0x1
#define _LCDDATA13_S41C1_SIZE                               0x1
#define _LCDDATA13_S41C1_LENGTH                             0x1
#define _LCDDATA13_S41C1_MASK                               0x2
#define _LCDDATA13_S42C1_POSN                               0x2
#define _LCDDATA13_S42C1_POSITION                           0x2
#define _LCDDATA13_S42C1_SIZE                               0x1
#define _LCDDATA13_S42C1_LENGTH                             0x1
#define _LCDDATA13_S42C1_MASK                               0x4
#define _LCDDATA13_S43C1_POSN                               0x3
#define _LCDDATA13_S43C1_POSITION                           0x3
#define _LCDDATA13_S43C1_SIZE                               0x1
#define _LCDDATA13_S43C1_LENGTH                             0x1
#define _LCDDATA13_S43C1_MASK                               0x8
#define _LCDDATA13_S44C1_POSN                               0x4
#define _LCDDATA13_S44C1_POSITION                           0x4
#define _LCDDATA13_S44C1_SIZE                               0x1
#define _LCDDATA13_S44C1_LENGTH                             0x1
#define _LCDDATA13_S44C1_MASK                               0x10
#define _LCDDATA13_S45C1_POSN                               0x5
#define _LCDDATA13_S45C1_POSITION                           0x5
#define _LCDDATA13_S45C1_SIZE                               0x1
#define _LCDDATA13_S45C1_LENGTH                             0x1
#define _LCDDATA13_S45C1_MASK                               0x20
#define _LCDDATA13_S46C1_POSN                               0x6
#define _LCDDATA13_S46C1_POSITION                           0x6
#define _LCDDATA13_S46C1_SIZE                               0x1
#define _LCDDATA13_S46C1_LENGTH                             0x1
#define _LCDDATA13_S46C1_MASK                               0x40
#define _LCDDATA13_S47C1_POSN                               0x7
#define _LCDDATA13_S47C1_POSITION                           0x7
#define _LCDDATA13_S47C1_SIZE                               0x1
#define _LCDDATA13_S47C1_LENGTH                             0x1
#define _LCDDATA13_S47C1_MASK                               0x80

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
extern volatile unsigned char           LCDDATA14           __at(0xE9C);
#ifndef _LIB_BUILD
asm("LCDDATA14 equ 0E9Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C1                  :1;
        unsigned S49C1                  :1;
        unsigned S50C1                  :1;
        unsigned S51C1                  :1;
        unsigned S52C1                  :1;
        unsigned S53C1                  :1;
        unsigned S54C1                  :1;
        unsigned S55C1                  :1;
    };
    struct {
        unsigned MSK0                   :1;
        unsigned MSK1                   :1;
        unsigned MSK2                   :1;
        unsigned MSK3                   :1;
        unsigned MSK4                   :1;
        unsigned MSK5                   :1;
        unsigned MSK6                   :1;
        unsigned MSK7                   :1;
    };
} LCDDATA14bits_t;
