MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile LCDDATA47bits_t LCDDATA47bits __at(0xEBD);
// bitfield macros
#define _LCDDATA47_S56C5_POSN                               0x0
#define _LCDDATA47_S56C5_POSITION                           0x0
#define _LCDDATA47_S56C5_SIZE                               0x1
#define _LCDDATA47_S56C5_LENGTH                             0x1
#define _LCDDATA47_S56C5_MASK                               0x1
#define _LCDDATA47_S57C5_POSN                               0x1
#define _LCDDATA47_S57C5_POSITION                           0x1
#define _LCDDATA47_S57C5_SIZE                               0x1
#define _LCDDATA47_S57C5_LENGTH                             0x1
#define _LCDDATA47_S57C5_MASK                               0x2
#define _LCDDATA47_S58C5_POSN                               0x2
#define _LCDDATA47_S58C5_POSITION                           0x2
#define _LCDDATA47_S58C5_SIZE                               0x1
#define _LCDDATA47_S58C5_LENGTH                             0x1
#define _LCDDATA47_S58C5_MASK                               0x4
#define _LCDDATA47_S59C5_POSN                               0x3
#define _LCDDATA47_S59C5_POSITION                           0x3
#define _LCDDATA47_S59C5_SIZE                               0x1
#define _LCDDATA47_S59C5_LENGTH                             0x1
#define _LCDDATA47_S59C5_MASK                               0x8
#define _LCDDATA47_S60C5_POSN                               0x4
#define _LCDDATA47_S60C5_POSITION                           0x4
#define _LCDDATA47_S60C5_SIZE                               0x1
#define _LCDDATA47_S60C5_LENGTH                             0x1
#define _LCDDATA47_S60C5_MASK                               0x10
#define _LCDDATA47_S61C5_POSN                               0x5
#define _LCDDATA47_S61C5_POSITION                           0x5
#define _LCDDATA47_S61C5_SIZE                               0x1
#define _LCDDATA47_S61C5_LENGTH                             0x1
#define _LCDDATA47_S61C5_MASK                               0x20
#define _LCDDATA47_S62C5_POSN                               0x6
#define _LCDDATA47_S62C5_POSITION                           0x6
#define _LCDDATA47_S62C5_SIZE                               0x1
#define _LCDDATA47_S62C5_LENGTH                             0x1
#define _LCDDATA47_S62C5_MASK                               0x40
#define _LCDDATA47_S63C5_POSN                               0x7
#define _LCDDATA47_S63C5_POSITION                           0x7
#define _LCDDATA47_S63C5_SIZE                               0x1
#define _LCDDATA47_S63C5_LENGTH                             0x1
#define _LCDDATA47_S63C5_MASK                               0x80

// Register: LCDDATA48
#define LCDDATA48 LCDDATA48
extern volatile unsigned char           LCDDATA48           __at(0xEBE);
#ifndef _LIB_BUILD
asm("LCDDATA48 equ 0EBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C6                  :1;
        unsigned S01C6                  :1;
        unsigned S02C6                  :1;
        unsigned S03C6                  :1;
        unsigned S04C6                  :1;
        unsigned S05C6                  :1;
        unsigned S06C6                  :1;
        unsigned S07C6                  :1;
    };
} LCDDATA48bits_t;
extern volatile LCDDATA48bits_t LCDDATA48bits __at(0xEBE);
// bitfield macros
#define _LCDDATA48_S00C6_POSN                               0x0
#define _LCDDATA48_S00C6_POSITION                           0x0
#define _LCDDATA48_S00C6_SIZE                               0x1
#define _LCDDATA48_S00C6_LENGTH                             0x1
#define _LCDDATA48_S00C6_MASK                               0x1
#define _LCDDATA48_S01C6_POSN                               0x1
#define _LCDDATA48_S01C6_POSITION                           0x1
#define _LCDDATA48_S01C6_SIZE                               0x1
#define _LCDDATA48_S01C6_LENGTH                             0x1
#define _LCDDATA48_S01C6_MASK                               0x2
#define _LCDDATA48_S02C6_POSN                               0x2
#define _LCDDATA48_S02C6_POSITION                           0x2
#define _LCDDATA48_S02C6_SIZE                               0x1
#define _LCDDATA48_S02C6_LENGTH                             0x1
#define _LCDDATA48_S02C6_MASK                               0x4
#define _LCDDATA48_S03C6_POSN                               0x3
#define _LCDDATA48_S03C6_POSITION                           0x3
#define _LCDDATA48_S03C6_SIZE                               0x1
#define _LCDDATA48_S03C6_LENGTH                             0x1
#define _LCDDATA48_S03C6_MASK                               0x8
#define _LCDDATA48_S04C6_POSN                               0x4
#define _LCDDATA48_S04C6_POSITION                           0x4
#define _LCDDATA48_S04C6_SIZE                               0x1
#define _LCDDATA48_S04C6_LENGTH                             0x1
#define _LCDDATA48_S04C6_MASK                               0x10
#define _LCDDATA48_S05C6_POSN                               0x5
#define _LCDDATA48_S05C6_POSITION                           0x5
#define _LCDDATA48_S05C6_SIZE                               0x1
#define _LCDDATA48_S05C6_LENGTH                             0x1
#define _LCDDATA48_S05C6_MASK                               0x20
#define _LCDDATA48_S06C6_POSN                               0x6
#define _LCDDATA48_S06C6_POSITION                           0x6
#define _LCDDATA48_S06C6_SIZE                               0x1
#define _LCDDATA48_S06C6_LENGTH                             0x1
#define _LCDDATA48_S06C6_MASK                               0x40
#define _LCDDATA48_S07C6_POSN                               0x7
#define _LCDDATA48_S07C6_POSITION                           0x7
#define _LCDDATA48_S07C6_SIZE                               0x1
#define _LCDDATA48_S07C6_LENGTH                             0x1
#define _LCDDATA48_S07C6_MASK                               0x80

// Register: LCDDATA49
#define LCDDATA49 LCDDATA49
extern volatile unsigned char           LCDDATA49           __at(0xEBF);
#ifndef _LIB_BUILD
asm("LCDDATA49 equ 0EBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C6                  :1;
        unsigned S09C6                  :1;
        unsigned S10C6                  :1;
        unsigned S11C6                  :1;
        unsigned S12C6                  :1;
        unsigned S13C6                  :1;
        unsigned S14C6                  :1;
        unsigned S15C6                  :1;
    };
} LCDDATA49bits_t;
extern volatile LCDDATA49bits_t LCDDATA49bits __at(0xEBF);
// bitfield macros
#define _LCDDATA49_S08C6_POSN                               0x0
#define _LCDDATA49_S08C6_POSITION                           0x0
#define _LCDDATA49_S08C6_SIZE                               0x1
#define _LCDDATA49_S08C6_LENGTH                             0x1
#define _LCDDATA49_S08C6_MASK                               0x1
#define _LCDDATA49_S09C6_POSN                               0x1
#define _LCDDATA49_S09C6_POSITION                           0x1
#define _LCDDATA49_S09C6_SIZE                               0x1
#define _LCDDATA49_S09C6_LENGTH                             0x1
#define _LCDDATA49_S09C6_MASK                               0x2
#define _LCDDATA49_S10C6_POSN                               0x2
#define _LCDDATA49_S10C6_POSITION                           0x2
#define _LCDDATA49_S10C6_SIZE                               0x1
#define _LCDDATA49_S10C6_LENGTH                             0x1
#define _LCDDATA49_S10C6_MASK                               0x4
#define _LCDDATA49_S11C6_POSN                               0x3
#define _LCDDATA49_S11C6_POSITION                           0x3
#define _LCDDATA49_S11C6_SIZE                               0x1
#define _LCDDATA49_S11C6_LENGTH                             0x1
#define _LCDDATA49_S11C6_MASK                               0x8
#define _LCDDATA49_S12C6_POSN                               0x4
#define _LCDDATA49_S12C6_POSITION                           0x4
#define _LCDDATA49_S12C6_SIZE                               0x1
#define _LCDDATA49_S12C6_LENGTH                             0x1
#define _LCDDATA49_S12C6_MASK                               0x10
#define _LCDDATA49_S13C6_POSN                               0x5
#define _LCDDATA49_S13C6_POSITION                           0x5
#define _LCDDATA49_S13C6_SIZE                               0x1
#define _LCDDATA49_S13C6_LENGTH                             0x1
#define _LCDDATA49_S13C6_MASK                               0x20
#define _LCDDATA49_S14C6_POSN                               0x6
#define _LCDDATA49_S14C6_POSITION                           0x6
#define _LCDDATA49_S14C6_SIZE                               0x1
#define _LCDDATA49_S14C6_LENGTH                             0x1
#define _LCDDATA49_S14C6_MASK                               0x40
#define _LCDDATA49_S15C6_POSN                               0x7
#define _LCDDATA49_S15C6_POSITION                           0x7
#define _LCDDATA49_S15C6_SIZE                               0x1
#define _LCDDATA49_S15C6_LENGTH                             0x1
#define _LCDDATA49_S15C6_MASK                               0x80

// Register: LCDDATA50
#define LCDDATA50 LCDDATA50
extern volatile unsigned char           LCDDATA50           __at(0xEC0);
#ifndef _LIB_BUILD
asm("LCDDATA50 equ 0EC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C6                  :1;
        unsigned S17C6                  :1;
        unsigned S18C6                  :1;
        unsigned S19C6                  :1;
        unsigned S20C6                  :1;
        unsigned S21C6                  :1;
        unsigned S22C6                  :1;
        unsigned S23C6                  :1;
    };
} LCDDATA50bits_t;
extern volatile LCDDATA50bits_t LCDDATA50bits __at(0xEC0);
// bitfield macros
#define _LCDDATA50_S16C6_POSN                               0x0
#define _LCDDATA50_S16C6_POSITION                           0x0
#define _LCDDATA50_S16C6_SIZE                               0x1
#define _LCDDATA50_S16C6_LENGTH                             0x1
#define _LCDDATA50_S16C6_MASK                               0x1
#define _LCDDATA50_S17C6_POSN                               0x1
#define _LCDDATA50_S17C6_POSITION                           0x1
#define _LCDDATA50_S17C6_SIZE                               0x1
#define _LCDDATA50_S17C6_LENGTH                             0x1
#define _LCDDATA50_S17C6_MASK                               0x2
#define _LCDDATA50_S18C6_POSN                               0x2
#define _LCDDATA50_S18C6_POSITION                           0x2
#define _LCDDATA50_S18C6_SIZE                               0x1
#define _LCDDATA50_S18C6_LENGTH                             0x1
#define _LCDDATA50_S18C6_MASK                               0x4
#define _LCDDATA50_S19C6_POSN                               0x3
#define _LCDDATA50_S19C6_POSITION                           0x3
#define _LCDDATA50_S19C6_SIZE                               0x1
#define _LCDDATA50_S19C6_LENGTH                             0x1
#define _LCDDATA50_S19C6_MASK                               0x8
#define _LCDDATA50_S20C6_POSN                               0x4
#define _LCDDATA50_S20C6_POSITION                           0x4
#define _LCDDATA50_S20C6_SIZE                               0x1
#define _LCDDATA50_S20C6_LENGTH                             0x1
#define _LCDDATA50_S20C6_MASK                               0x10
#define _LCDDATA50_S21C6_POSN                               0x5
#define _LCDDATA50_S21C6_POSITION                           0x5
#define _LCDDATA50_S21C6_SIZE                               0x1
#define _LCDDATA50_S21C6_LENGTH                             0x1
#define _LCDDATA50_S21C6_MASK                               0x20
#define _LCDDATA50_S22C6_POSN                               0x6
#define _LCDDATA50_S22C6_POSITION                           0x6
#define _LCDDATA50_S22C6_SIZE                               0x1
#define _LCDDATA50_S22C6_LENGTH                             0x1
#define _LCDDATA50_S22C6_MASK                               0x40
#define _LCDDATA50_S23C6_POSN                               0x7
#define _LCDDATA50_S23C6_POSITION                           0x7
#define _LCDDATA50_S23C6_SIZE                               0x1
#define _LCDDATA50_S23C6_LENGTH                             0x1
#define _LCDDATA50_S23C6_MASK                               0x80

// Register: LCDDATA51
#define LCDDATA51 LCDDATA51
extern volatile unsigned char           LCDDATA51           __at(0xEC1);
#ifndef _LIB_BUILD
asm("LCDDATA51 equ 0EC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C6                  :1;
        unsigned S25C6                  :1;
        unsigned S26C6                  :1;
        unsigned S27C6                  :1;
        unsigned S28C6                  :1;
        unsigned S29C6                  :1;
        unsigned S30C6                  :1;
        unsigned S31C6                  :1;
    };
} LCDDATA51bits_t;
extern volatile LCDDATA51bits_t LCDDATA51bits __at(0xEC1);
// bitfield macros
#define _LCDDATA51_S24C6_POSN                               0x0
#define _LCDDATA51_S24C6_POSITION                           0x0
#define _LCDDATA51_S24C6_SIZE                               0x1
#define _LCDDATA51_S24C6_LENGTH                             0x1
#define _LCDDATA51_S24C6_MASK                               0x1
#define _LCDDATA51_S25C6_POSN                               0x1
#define _LCDDATA51_S25C6_POSITION                           0x1
#define _LCDDATA51_S25C6_SIZE                               0x1
#define _LCDDATA51_S25C6_LENGTH                             0x1
#define _LCDDATA51_S25C6_MASK                               0x2
#define _LCDDATA51_S26C6_POSN                               0x2
#define _LCDDATA51_S26C6_POSITION                           0x2
#define _LCDDATA51_S26C6_SIZE                               0x1
#define _LCDDATA51_S26C6_LENGTH                             0x1
#define _LCDDATA51_S26C6_MASK                               0x4
#define _LCDDATA51_S27C6_POSN                               0x3
#define _LCDDATA51_S27C6_POSITION                           0x3
#define _LCDDATA51_S27C6_SIZE                               0x1
#define _LCDDATA51_S27C6_LENGTH                             0x1
#define _LCDDATA51_S27C6_MASK                               0x8
#define _LCDDATA51_S28C6_POSN                               0x4
#define _LCDDATA51_S28C6_POSITION                           0x4
#define _LCDDATA51_S28C6_SIZE                               0x1
#define _LCDDATA51_S28C6_LENGTH                             0x1
#define _LCDDATA51_S28C6_MASK                               0x10
#define _LCDDATA51_S29C6_POSN                               0x5
#define _LCDDATA51_S29C6_POSITION                           0x5
#define _LCDDATA51_S29C6_SIZE                               0x1
#define _LCDDATA51_S29C6_LENGTH                             0x1
#define _LCDDATA51_S29C6_MASK                               0x20
#define _LCDDATA51_S30C6_POSN                               0x6
#define _LCDDATA51_S30C6_POSITION                           0x6
#define _LCDDATA51_S30C6_SIZE                               0x1
#define _LCDDATA51_S30C6_LENGTH                             0x1
#define _LCDDATA51_S30C6_MASK                               0x40
#define _LCDDATA51_S31C6_POSN                               0x7
#define _LCDDATA51_S31C6_POSITION                           0x7
#define _LCDDATA51_S31C6_SIZE                               0x1
#define _LCDDATA51_S31C6_LENGTH                             0x1
#define _LCDDATA51_S31C6_MASK                               0x80

// Register: LCDDATA52
#define LCDDATA52 LCDDATA52
extern volatile unsigned char           LCDDATA52           __at(0xEC2);
#ifndef _LIB_BUILD
asm("LCDDATA52 equ 0EC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C6                  :1;
        unsigned S33C6                  :1;
        unsigned S34C6                  :1;
        unsigned S35C6                  :1;
        unsigned S36C6                  :1;
        unsigned S37C6                  :1;
        unsigned S38C6                  :1;
        unsigned S39C6                  :1;
    };
} LCDDATA52bits_t;
extern volatile LCDDATA52bits_t LCDDATA52bits __at(0xEC2);
// bitfield macros
#define _LCDDATA52_S32C6_POSN                               0x0
#define _LCDDATA52_S32C6_POSITION                           0x0
#define _LCDDATA52_S32C6_SIZE                               0x1
#define _LCDDATA52_S32C6_LENGTH                             0x1
#define _LCDDATA52_S32C6_MASK                               0x1
#define _LCDDATA52_S33C6_POSN                               0x1
#define _LCDDATA52_S33C6_POSITION                           0x1
#define _LCDDATA52_S33C6_SIZE                               0x1
#define _LCDDATA52_S33C6_LENGTH                             0x1
#define _LCDDATA52_S33C6_MASK                               0x2
#define _LCDDATA52_S34C6_POSN                               0x2
#define _LCDDATA52_S34C6_POSITION                           0x2
#define _LCDDATA52_S34C6_SIZE                               0x1
#define _LCDDATA52_S34C6_LENGTH                             0x1
#define _LCDDATA52_S34C6_MASK                               0x4
#define _LCDDATA52_S35C6_POSN                               0x3
#define _LCDDATA52_S35C6_POSITION                           0x3
#define _LCDDATA52_S35C6_SIZE                               0x1
#define _LCDDATA52_S35C6_LENGTH                             0x1
#define _LCDDATA52_S35C6_MASK                               0x8
#define _LCDDATA52_S36C6_POSN                               0x4
#define _LCDDATA52_S36C6_POSITION                           0x4
#define _LCDDATA52_S36C6_SIZE                               0x1
#define _LCDDATA52_S36C6_LENGTH                             0x1
#define _LCDDATA52_S36C6_MASK                               0x10
#define _LCDDATA52_S37C6_POSN                               0x5
#define _LCDDATA52_S37C6_POSITION                           0x5
#define _LCDDATA52_S37C6_SIZE                               0x1
#define _LCDDATA52_S37C6_LENGTH                             0x1
#define _LCDDATA52_S37C6_MASK                               0x20
#define _LCDDATA52_S38C6_POSN                               0x6
#define _LCDDATA52_S38C6_POSITION                           0x6
#define _LCDDATA52_S38C6_SIZE                               0x1
#define _LCDDATA52_S38C6_LENGTH                             0x1
#define _LCDDATA52_S38C6_MASK                               0x40
#define _LCDDATA52_S39C6_POSN                               0x7
#define _LCDDATA52_S39C6_POSITION                           0x7
#define _LCDDATA52_S39C6_SIZE                               0x1
#define _LCDDATA52_S39C6_LENGTH                             0x1
#define _LCDDATA52_S39C6_MASK                               0x80

// Register: LCDDATA53
#define LCDDATA53 LCDDATA53
extern volatile unsigned char           LCDDATA53           __at(0xEC3);
#ifndef _LIB_BUILD
asm("LCDDATA53 equ 0EC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C6                  :1;
        unsigned S41C6                  :1;
        unsigned S42C6                  :1;
        unsigned S43C6                  :1;
        unsigned S44C6                  :1;
        unsigned S45C6                  :1;
        unsigned S46C6                  :1;
        unsigned S47C6                  :1;
    };
} LCDDATA53bits_t;
extern volatile LCDDATA53bits_t LCDDATA53bits __at(0xEC3);
// bitfield macros
#define _LCDDATA53_S40C6_POSN                               0x0
#define _LCDDATA53_S40C6_POSITION                           0x0
#define _LCDDATA53_S40C6_SIZE                               0x1
#define _LCDDATA53_S40C6_LENGTH                             0x1
#define _LCDDATA53_S40C6_MASK                               0x1
#define _LCDDATA53_S41C6_POSN                               0x1
#define _LCDDATA53_S41C6_POSITION                           0x1
#define _LCDDATA53_S41C6_SIZE                               0x1
#define _LCDDATA53_S41C6_LENGTH                             0x1
#define _LCDDATA53_S41C6_MASK                               0x2
#define _LCDDATA53_S42C6_POSN                               0x2
#define _LCDDATA53_S42C6_POSITION                           0x2
#define _LCDDATA53_S42C6_SIZE                               0x1
#define _LCDDATA53_S42C6_LENGTH                             0x1
#define _LCDDATA53_S42C6_MASK                               0x4
#define _LCDDATA53_S43C6_POSN                               0x3
#define _LCDDATA53_S43C6_POSITION                           0x3
#define _LCDDATA53_S43C6_SIZE                               0x1
#define _LCDDATA53_S43C6_LENGTH                             0x1
#define _LCDDATA53_S43C6_MASK                               0x8
#define _LCDDATA53_S44C6_POSN                               0x4
#define _LCDDATA53_S44C6_POSITION                           0x4
#define _LCDDATA53_S44C6_SIZE                               0x1
#define _LCDDATA53_S44C6_LENGTH                             0x1
#define _LCDDATA53_S44C6_MASK                               0x10
#define _LCDDATA53_S45C6_POSN                               0x5
#define _LCDDATA53_S45C6_POSITION                           0x5
#define _LCDDATA53_S45C6_SIZE                               0x1
#define _LCDDATA53_S45C6_LENGTH                             0x1
#define _LCDDATA53_S45C6_MASK                               0x20
#define _LCDDATA53_S46C6_POSN                               0x6
#define _LCDDATA53_S46C6_POSITION                           0x6
#define _LCDDATA53_S46C6_SIZE                               0x1
#define _LCDDATA53_S46C6_LENGTH                             0x1
#define _LCDDATA53_S46C6_MASK                               0x40
#define _LCDDATA53_S47C6_POSN                               0x7
#define _LCDDATA53_S47C6_POSITION                           0x7
#define _LCDDATA53_S47C6_SIZE                               0x1
#define _LCDDATA53_S47C6_LENGTH                             0x1
#define _LCDDATA53_S47C6_MASK                               0x80

// Register: LCDDATA54
#define LCDDATA54 LCDDATA54
extern volatile unsigned char           LCDDATA54           __at(0xEC4);
#ifndef _LIB_BUILD
asm("LCDDATA54 equ 0EC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C6                  :1;
        unsigned S49C6                  :1;
        unsigned S50C6                  :1;
        unsigned S51C6                  :1;
        unsigned S52C6                  :1;
        unsigned S53C6                  :1;
        unsigned S54C6                  :1;
        unsigned S55C6                  :1;
    };
} LCDDATA54bits_t;
