MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile MDCARHbits_t MDCARHbits __at(0xEED);
// bitfield macros
#define _MDCARH_MDCH_POSN                                   0x0
#define _MDCARH_MDCH_POSITION                               0x0
#define _MDCARH_MDCH_SIZE                                   0x4
#define _MDCARH_MDCH_LENGTH                                 0x4
#define _MDCARH_MDCH_MASK                                   0xF
#define _MDCARH_MDCHSYNC_POSN                               0x5
#define _MDCARH_MDCHSYNC_POSITION                           0x5
#define _MDCARH_MDCHSYNC_SIZE                               0x1
#define _MDCARH_MDCHSYNC_LENGTH                             0x1
#define _MDCARH_MDCHSYNC_MASK                               0x20
#define _MDCARH_MDCHPOL_POSN                                0x6
#define _MDCARH_MDCHPOL_POSITION                            0x6
#define _MDCARH_MDCHPOL_SIZE                                0x1
#define _MDCARH_MDCHPOL_LENGTH                              0x1
#define _MDCARH_MDCHPOL_MASK                                0x40
#define _MDCARH_MDCHODIS_POSN                               0x7
#define _MDCARH_MDCHODIS_POSITION                           0x7
#define _MDCARH_MDCHODIS_SIZE                               0x1
#define _MDCARH_MDCHODIS_LENGTH                             0x1
#define _MDCARH_MDCHODIS_MASK                               0x80
#define _MDCARH_MDCH0_POSN                                  0x0
#define _MDCARH_MDCH0_POSITION                              0x0
#define _MDCARH_MDCH0_SIZE                                  0x1
#define _MDCARH_MDCH0_LENGTH                                0x1
#define _MDCARH_MDCH0_MASK                                  0x1
#define _MDCARH_MDCH1_POSN                                  0x1
#define _MDCARH_MDCH1_POSITION                              0x1
#define _MDCARH_MDCH1_SIZE                                  0x1
#define _MDCARH_MDCH1_LENGTH                                0x1
#define _MDCARH_MDCH1_MASK                                  0x2
#define _MDCARH_MDCH2_POSN                                  0x2
#define _MDCARH_MDCH2_POSITION                              0x2
#define _MDCARH_MDCH2_SIZE                                  0x1
#define _MDCARH_MDCH2_LENGTH                                0x1
#define _MDCARH_MDCH2_MASK                                  0x4
#define _MDCARH_MDCH3_POSN                                  0x3
#define _MDCARH_MDCH3_POSITION                              0x3
#define _MDCARH_MDCH3_SIZE                                  0x1
#define _MDCARH_MDCH3_LENGTH                                0x1
#define _MDCARH_MDCH3_MASK                                  0x8

// Register: MDSRC
#define MDSRC MDSRC
extern volatile unsigned char           MDSRC               __at(0xEEE);
#ifndef _LIB_BUILD
asm("MDSRC equ 0EEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDSRC                  :4;
        unsigned                        :3;
        unsigned MDSODIS                :1;
    };
    struct {
        unsigned MDSRC0                 :1;
        unsigned MDSRC1                 :1;
        unsigned MDSRC2                 :1;
        unsigned MDSRC3                 :1;
    };
} MDSRCbits_t;
extern volatile MDSRCbits_t MDSRCbits __at(0xEEE);
// bitfield macros
#define _MDSRC_MDSRC_POSN                                   0x0
#define _MDSRC_MDSRC_POSITION                               0x0
#define _MDSRC_MDSRC_SIZE                                   0x4
#define _MDSRC_MDSRC_LENGTH                                 0x4
#define _MDSRC_MDSRC_MASK                                   0xF
#define _MDSRC_MDSODIS_POSN                                 0x7
#define _MDSRC_MDSODIS_POSITION                             0x7
#define _MDSRC_MDSODIS_SIZE                                 0x1
#define _MDSRC_MDSODIS_LENGTH                               0x1
#define _MDSRC_MDSODIS_MASK                                 0x80
#define _MDSRC_MDSRC0_POSN                                  0x0
#define _MDSRC_MDSRC0_POSITION                              0x0
#define _MDSRC_MDSRC0_SIZE                                  0x1
#define _MDSRC_MDSRC0_LENGTH                                0x1
#define _MDSRC_MDSRC0_MASK                                  0x1
#define _MDSRC_MDSRC1_POSN                                  0x1
#define _MDSRC_MDSRC1_POSITION                              0x1
#define _MDSRC_MDSRC1_SIZE                                  0x1
#define _MDSRC_MDSRC1_LENGTH                                0x1
#define _MDSRC_MDSRC1_MASK                                  0x2
#define _MDSRC_MDSRC2_POSN                                  0x2
#define _MDSRC_MDSRC2_POSITION                              0x2
#define _MDSRC_MDSRC2_SIZE                                  0x1
#define _MDSRC_MDSRC2_LENGTH                                0x1
#define _MDSRC_MDSRC2_MASK                                  0x4
#define _MDSRC_MDSRC3_POSN                                  0x3
#define _MDSRC_MDSRC3_POSITION                              0x3
#define _MDSRC_MDSRC3_SIZE                                  0x1
#define _MDSRC_MDSRC3_LENGTH                                0x1
#define _MDSRC_MDSRC3_MASK                                  0x8

// Register: MDCON
#define MDCON MDCON
extern volatile unsigned char           MDCON               __at(0xEEF);
#ifndef _LIB_BUILD
asm("MDCON equ 0EEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDBIT                  :1;
        unsigned                        :2;
        unsigned MDO                    :1;
        unsigned MDOPOL                 :1;
        unsigned MDSLR                  :1;
        unsigned MDOE                   :1;
        unsigned MDEN                   :1;
    };
} MDCONbits_t;
extern volatile MDCONbits_t MDCONbits __at(0xEEF);
// bitfield macros
#define _MDCON_MDBIT_POSN                                   0x0
#define _MDCON_MDBIT_POSITION                               0x0
#define _MDCON_MDBIT_SIZE                                   0x1
#define _MDCON_MDBIT_LENGTH                                 0x1
#define _MDCON_MDBIT_MASK                                   0x1
#define _MDCON_MDO_POSN                                     0x3
#define _MDCON_MDO_POSITION                                 0x3
#define _MDCON_MDO_SIZE                                     0x1
#define _MDCON_MDO_LENGTH                                   0x1
#define _MDCON_MDO_MASK                                     0x8
#define _MDCON_MDOPOL_POSN                                  0x4
#define _MDCON_MDOPOL_POSITION                              0x4
#define _MDCON_MDOPOL_SIZE                                  0x1
#define _MDCON_MDOPOL_LENGTH                                0x1
#define _MDCON_MDOPOL_MASK                                  0x10
#define _MDCON_MDSLR_POSN                                   0x5
#define _MDCON_MDSLR_POSITION                               0x5
#define _MDCON_MDSLR_SIZE                                   0x1
#define _MDCON_MDSLR_LENGTH                                 0x1
#define _MDCON_MDSLR_MASK                                   0x20
#define _MDCON_MDOE_POSN                                    0x6
#define _MDCON_MDOE_POSITION                                0x6
#define _MDCON_MDOE_SIZE                                    0x1
#define _MDCON_MDOE_LENGTH                                  0x1
#define _MDCON_MDOE_MASK                                    0x40
#define _MDCON_MDEN_POSN                                    0x7
#define _MDCON_MDEN_POSITION                                0x7
#define _MDCON_MDEN_SIZE                                    0x1
#define _MDCON_MDEN_LENGTH                                  0x1
#define _MDCON_MDEN_MASK                                    0x80

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0xEF0);
#ifndef _LIB_BUILD
asm("PMD4 equ 0EF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EMBMD                  :1;
        unsigned                        :1;
        unsigned LVDMD                  :1;
        unsigned IOCMD                  :1;
        unsigned USBMD                  :1;
        unsigned CMP3MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CMP1MD                 :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0xEF0);
// bitfield macros
#define _PMD4_EMBMD_POSN                                    0x0
#define _PMD4_EMBMD_POSITION                                0x0
#define _PMD4_EMBMD_SIZE                                    0x1
#define _PMD4_EMBMD_LENGTH                                  0x1
#define _PMD4_EMBMD_MASK                                    0x1
#define _PMD4_LVDMD_POSN                                    0x2
#define _PMD4_LVDMD_POSITION                                0x2
#define _PMD4_LVDMD_SIZE                                    0x1
#define _PMD4_LVDMD_LENGTH                                  0x1
#define _PMD4_LVDMD_MASK                                    0x4
#define _PMD4_IOCMD_POSN                                    0x3
#define _PMD4_IOCMD_POSITION                                0x3
#define _PMD4_IOCMD_SIZE                                    0x1
#define _PMD4_IOCMD_LENGTH                                  0x1
#define _PMD4_IOCMD_MASK                                    0x8
#define _PMD4_USBMD_POSN                                    0x4
#define _PMD4_USBMD_POSITION                                0x4
#define _PMD4_USBMD_SIZE                                    0x1
#define _PMD4_USBMD_LENGTH                                  0x1
#define _PMD4_USBMD_MASK                                    0x10
#define _PMD4_CMP3MD_POSN                                   0x5
#define _PMD4_CMP3MD_POSITION                               0x5
#define _PMD4_CMP3MD_SIZE                                   0x1
#define _PMD4_CMP3MD_LENGTH                                 0x1
#define _PMD4_CMP3MD_MASK                                   0x20
#define _PMD4_CMP2MD_POSN                                   0x6
#define _PMD4_CMP2MD_POSITION                               0x6
#define _PMD4_CMP2MD_SIZE                                   0x1
#define _PMD4_CMP2MD_LENGTH                                 0x1
#define _PMD4_CMP2MD_MASK                                   0x40
#define _PMD4_CMP1MD_POSN                                   0x7
#define _PMD4_CMP1MD_POSITION                               0x7
#define _PMD4_CMP1MD_SIZE                                   0x1
#define _PMD4_CMP1MD_LENGTH                                 0x1
#define _PMD4_CMP1MD_MASK                                   0x80

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0xEF1);
#ifndef _LIB_BUILD
asm("PMD3 equ 0EF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REFO2MD                :1;
        unsigned REFO1MD                :1;
        unsigned PSPMD                  :1;
        unsigned LCDMD                  :1;
        unsigned RTCCMD                 :1;
        unsigned ADCMD                  :1;
        unsigned CTMUMD                 :1;
        unsigned MODMD                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned TXMMD                  :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0xEF1);
// bitfield macros
#define _PMD3_REFO2MD_POSN                                  0x0
#define _PMD3_REFO2MD_POSITION                              0x0
#define _PMD3_REFO2MD_SIZE                                  0x1
#define _PMD3_REFO2MD_LENGTH                                0x1
#define _PMD3_REFO2MD_MASK                                  0x1
#define _PMD3_REFO1MD_POSN                                  0x1
#define _PMD3_REFO1MD_POSITION                              0x1
#define _PMD3_REFO1MD_SIZE                                  0x1
#define _PMD3_REFO1MD_LENGTH                                0x1
#define _PMD3_REFO1MD_MASK                                  0x2
#define _PMD3_PSPMD_POSN                                    0x2
#define _PMD3_PSPMD_POSITION                                0x2
#define _PMD3_PSPMD_SIZE                                    0x1
#define _PMD3_PSPMD_LENGTH                                  0x1
#define _PMD3_PSPMD_MASK                                    0x4
#define _PMD3_LCDMD_POSN                                    0x3
#define _PMD3_LCDMD_POSITION                                0x3
#define _PMD3_LCDMD_SIZE                                    0x1
#define _PMD3_LCDMD_LENGTH                                  0x1
#define _PMD3_LCDMD_MASK                                    0x8
#define _PMD3_RTCCMD_POSN                                   0x4
#define _PMD3_RTCCMD_POSITION                               0x4
#define _PMD3_RTCCMD_SIZE                                   0x1
#define _PMD3_RTCCMD_LENGTH                                 0x1
#define _PMD3_RTCCMD_MASK                                   0x10
#define _PMD3_ADCMD_POSN                                    0x5
#define _PMD3_ADCMD_POSITION                                0x5
#define _PMD3_ADCMD_SIZE                                    0x1
#define _PMD3_ADCMD_LENGTH                                  0x1
#define _PMD3_ADCMD_MASK                                    0x20
#define _PMD3_CTMUMD_POSN                                   0x6
#define _PMD3_CTMUMD_POSITION                               0x6
#define _PMD3_CTMUMD_SIZE                                   0x1
#define _PMD3_CTMUMD_LENGTH                                 0x1
#define _PMD3_CTMUMD_MASK                                   0x40
#define _PMD3_MODMD_POSN                                    0x7
#define _PMD3_MODMD_POSITION                                0x7
#define _PMD3_MODMD_SIZE                                    0x1
#define _PMD3_MODMD_LENGTH                                  0x1
#define _PMD3_MODMD_MASK                                    0x80
#define _PMD3_TXMMD_POSN                                    0x7
#define _PMD3_TXMMD_POSITION                                0x7
#define _PMD3_TXMMD_SIZE                                    0x1
#define _PMD3_TXMMD_LENGTH                                  0x1
#define _PMD3_TXMMD_MASK                                    0x80

