MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile SPBRGH4bits_t SPBRGH4bits __at(0xEFC);
// bitfield macros
#define _SPBRGH4_SPBRGH4_POSN                               0x0
#define _SPBRGH4_SPBRGH4_POSITION                           0x0
#define _SPBRGH4_SPBRGH4_SIZE                               0x8
#define _SPBRGH4_SPBRGH4_LENGTH                             0x8
#define _SPBRGH4_SPBRGH4_MASK                               0xFF
#define _SPBRGH4_BRG8_POSN                                  0x0
#define _SPBRGH4_BRG8_POSITION                              0x0
#define _SPBRGH4_BRG8_SIZE                                  0x1
#define _SPBRGH4_BRG8_LENGTH                                0x1
#define _SPBRGH4_BRG8_MASK                                  0x1
#define _SPBRGH4_BRG9_POSN                                  0x1
#define _SPBRGH4_BRG9_POSITION                              0x1
#define _SPBRGH4_BRG9_SIZE                                  0x1
#define _SPBRGH4_BRG9_LENGTH                                0x1
#define _SPBRGH4_BRG9_MASK                                  0x2
#define _SPBRGH4_BRG10_POSN                                 0x2
#define _SPBRGH4_BRG10_POSITION                             0x2
#define _SPBRGH4_BRG10_SIZE                                 0x1
#define _SPBRGH4_BRG10_LENGTH                               0x1
#define _SPBRGH4_BRG10_MASK                                 0x4
#define _SPBRGH4_BRG11_POSN                                 0x3
#define _SPBRGH4_BRG11_POSITION                             0x3
#define _SPBRGH4_BRG11_SIZE                                 0x1
#define _SPBRGH4_BRG11_LENGTH                               0x1
#define _SPBRGH4_BRG11_MASK                                 0x8
#define _SPBRGH4_BRG12_POSN                                 0x4
#define _SPBRGH4_BRG12_POSITION                             0x4
#define _SPBRGH4_BRG12_SIZE                                 0x1
#define _SPBRGH4_BRG12_LENGTH                               0x1
#define _SPBRGH4_BRG12_MASK                                 0x10
#define _SPBRGH4_BRG13_POSN                                 0x5
#define _SPBRGH4_BRG13_POSITION                             0x5
#define _SPBRGH4_BRG13_SIZE                                 0x1
#define _SPBRGH4_BRG13_LENGTH                               0x1
#define _SPBRGH4_BRG13_MASK                                 0x20
#define _SPBRGH4_BRG14_POSN                                 0x6
#define _SPBRGH4_BRG14_POSITION                             0x6
#define _SPBRGH4_BRG14_SIZE                                 0x1
#define _SPBRGH4_BRG14_LENGTH                               0x1
#define _SPBRGH4_BRG14_MASK                                 0x40
#define _SPBRGH4_BRG15_POSN                                 0x7
#define _SPBRGH4_BRG15_POSITION                             0x7
#define _SPBRGH4_BRG15_SIZE                                 0x1
#define _SPBRGH4_BRG15_LENGTH                               0x1
#define _SPBRGH4_BRG15_MASK                                 0x80

// Register: BAUDCON4
#define BAUDCON4 BAUDCON4
extern volatile unsigned char           BAUDCON4            __at(0xEFD);
#ifndef _LIB_BUILD
asm("BAUDCON4 equ 0EFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned IREN                   :1;
        unsigned BRG16                  :1;
        unsigned TXCKP                  :1;
        unsigned RXDTP                  :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN4                 :1;
        unsigned WUE4                   :1;
        unsigned                        :1;
        unsigned BRG164                 :1;
        unsigned SCKP4                  :1;
        unsigned DTRXP4                 :1;
        unsigned RCIDL4                 :1;
        unsigned ABDOVF4                :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP4                 :1;
        unsigned RXDTP4                 :1;
        unsigned RCMT4                  :1;
    };
} BAUDCON4bits_t;
extern volatile BAUDCON4bits_t BAUDCON4bits __at(0xEFD);
// bitfield macros
#define _BAUDCON4_ABDEN_POSN                                0x0
#define _BAUDCON4_ABDEN_POSITION                            0x0
#define _BAUDCON4_ABDEN_SIZE                                0x1
#define _BAUDCON4_ABDEN_LENGTH                              0x1
#define _BAUDCON4_ABDEN_MASK                                0x1
#define _BAUDCON4_WUE_POSN                                  0x1
#define _BAUDCON4_WUE_POSITION                              0x1
#define _BAUDCON4_WUE_SIZE                                  0x1
#define _BAUDCON4_WUE_LENGTH                                0x1
#define _BAUDCON4_WUE_MASK                                  0x2
#define _BAUDCON4_IREN_POSN                                 0x2
#define _BAUDCON4_IREN_POSITION                             0x2
#define _BAUDCON4_IREN_SIZE                                 0x1
#define _BAUDCON4_IREN_LENGTH                               0x1
#define _BAUDCON4_IREN_MASK                                 0x4
#define _BAUDCON4_BRG16_POSN                                0x3
#define _BAUDCON4_BRG16_POSITION                            0x3
#define _BAUDCON4_BRG16_SIZE                                0x1
#define _BAUDCON4_BRG16_LENGTH                              0x1
#define _BAUDCON4_BRG16_MASK                                0x8
#define _BAUDCON4_TXCKP_POSN                                0x4
#define _BAUDCON4_TXCKP_POSITION                            0x4
#define _BAUDCON4_TXCKP_SIZE                                0x1
#define _BAUDCON4_TXCKP_LENGTH                              0x1
#define _BAUDCON4_TXCKP_MASK                                0x10
#define _BAUDCON4_RXDTP_POSN                                0x5
#define _BAUDCON4_RXDTP_POSITION                            0x5
#define _BAUDCON4_RXDTP_SIZE                                0x1
#define _BAUDCON4_RXDTP_LENGTH                              0x1
#define _BAUDCON4_RXDTP_MASK                                0x20
#define _BAUDCON4_RCIDL_POSN                                0x6
#define _BAUDCON4_RCIDL_POSITION                            0x6
#define _BAUDCON4_RCIDL_SIZE                                0x1
#define _BAUDCON4_RCIDL_LENGTH                              0x1
#define _BAUDCON4_RCIDL_MASK                                0x40
#define _BAUDCON4_ABDOVF_POSN                               0x7
#define _BAUDCON4_ABDOVF_POSITION                           0x7
#define _BAUDCON4_ABDOVF_SIZE                               0x1
#define _BAUDCON4_ABDOVF_LENGTH                             0x1
#define _BAUDCON4_ABDOVF_MASK                               0x80
#define _BAUDCON4_ABDEN4_POSN                               0x0
#define _BAUDCON4_ABDEN4_POSITION                           0x0
#define _BAUDCON4_ABDEN4_SIZE                               0x1
#define _BAUDCON4_ABDEN4_LENGTH                             0x1
#define _BAUDCON4_ABDEN4_MASK                               0x1
#define _BAUDCON4_WUE4_POSN                                 0x1
#define _BAUDCON4_WUE4_POSITION                             0x1
#define _BAUDCON4_WUE4_SIZE                                 0x1
#define _BAUDCON4_WUE4_LENGTH                               0x1
#define _BAUDCON4_WUE4_MASK                                 0x2
#define _BAUDCON4_BRG164_POSN                               0x3
#define _BAUDCON4_BRG164_POSITION                           0x3
#define _BAUDCON4_BRG164_SIZE                               0x1
#define _BAUDCON4_BRG164_LENGTH                             0x1
#define _BAUDCON4_BRG164_MASK                               0x8
#define _BAUDCON4_SCKP4_POSN                                0x4
#define _BAUDCON4_SCKP4_POSITION                            0x4
#define _BAUDCON4_SCKP4_SIZE                                0x1
#define _BAUDCON4_SCKP4_LENGTH                              0x1
#define _BAUDCON4_SCKP4_MASK                                0x10
#define _BAUDCON4_DTRXP4_POSN                               0x5
#define _BAUDCON4_DTRXP4_POSITION                           0x5
#define _BAUDCON4_DTRXP4_SIZE                               0x1
#define _BAUDCON4_DTRXP4_LENGTH                             0x1
#define _BAUDCON4_DTRXP4_MASK                               0x20
#define _BAUDCON4_RCIDL4_POSN                               0x6
#define _BAUDCON4_RCIDL4_POSITION                           0x6
#define _BAUDCON4_RCIDL4_SIZE                               0x1
#define _BAUDCON4_RCIDL4_LENGTH                             0x1
#define _BAUDCON4_RCIDL4_MASK                               0x40
#define _BAUDCON4_ABDOVF4_POSN                              0x7
#define _BAUDCON4_ABDOVF4_POSITION                          0x7
#define _BAUDCON4_ABDOVF4_SIZE                              0x1
#define _BAUDCON4_ABDOVF4_LENGTH                            0x1
#define _BAUDCON4_ABDOVF4_MASK                              0x80
#define _BAUDCON4_TXCKP4_POSN                               0x4
#define _BAUDCON4_TXCKP4_POSITION                           0x4
#define _BAUDCON4_TXCKP4_SIZE                               0x1
#define _BAUDCON4_TXCKP4_LENGTH                             0x1
#define _BAUDCON4_TXCKP4_MASK                               0x10
#define _BAUDCON4_RXDTP4_POSN                               0x5
#define _BAUDCON4_RXDTP4_POSITION                           0x5
#define _BAUDCON4_RXDTP4_SIZE                               0x1
#define _BAUDCON4_RXDTP4_LENGTH                             0x1
#define _BAUDCON4_RXDTP4_MASK                               0x20
#define _BAUDCON4_RCMT4_POSN                                0x6
#define _BAUDCON4_RCMT4_POSITION                            0x6
#define _BAUDCON4_RCMT4_SIZE                                0x1
#define _BAUDCON4_RCMT4_LENGTH                              0x1
#define _BAUDCON4_RCMT4_MASK                                0x40

// Register: TXSTA4
#define TXSTA4 TXSTA4
extern volatile unsigned char           TXSTA4              __at(0xEFE);
#ifndef _LIB_BUILD
asm("TXSTA4 equ 0EFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
    struct {
        unsigned TXD84                  :1;
        unsigned                        :5;
        unsigned TX8_94                 :1;
    };
} TXSTA4bits_t;
extern volatile TXSTA4bits_t TXSTA4bits __at(0xEFE);
// bitfield macros
#define _TXSTA4_TX9D_POSN                                   0x0
#define _TXSTA4_TX9D_POSITION                               0x0
#define _TXSTA4_TX9D_SIZE                                   0x1
#define _TXSTA4_TX9D_LENGTH                                 0x1
#define _TXSTA4_TX9D_MASK                                   0x1
#define _TXSTA4_TRMT_POSN                                   0x1
#define _TXSTA4_TRMT_POSITION                               0x1
#define _TXSTA4_TRMT_SIZE                                   0x1
#define _TXSTA4_TRMT_LENGTH                                 0x1
#define _TXSTA4_TRMT_MASK                                   0x2
#define _TXSTA4_BRGH_POSN                                   0x2
#define _TXSTA4_BRGH_POSITION                               0x2
#define _TXSTA4_BRGH_SIZE                                   0x1
#define _TXSTA4_BRGH_LENGTH                                 0x1
#define _TXSTA4_BRGH_MASK                                   0x4
#define _TXSTA4_SENDB_POSN                                  0x3
#define _TXSTA4_SENDB_POSITION                              0x3
#define _TXSTA4_SENDB_SIZE                                  0x1
#define _TXSTA4_SENDB_LENGTH                                0x1
#define _TXSTA4_SENDB_MASK                                  0x8
#define _TXSTA4_SYNC_POSN                                   0x4
#define _TXSTA4_SYNC_POSITION                               0x4
#define _TXSTA4_SYNC_SIZE                                   0x1
#define _TXSTA4_SYNC_LENGTH                                 0x1
#define _TXSTA4_SYNC_MASK                                   0x10
#define _TXSTA4_TXEN_POSN                                   0x5
#define _TXSTA4_TXEN_POSITION                               0x5
#define _TXSTA4_TXEN_SIZE                                   0x1
#define _TXSTA4_TXEN_LENGTH                                 0x1
#define _TXSTA4_TXEN_MASK                                   0x20
#define _TXSTA4_TX9_POSN                                    0x6
#define _TXSTA4_TX9_POSITION                                0x6
#define _TXSTA4_TX9_SIZE                                    0x1
#define _TXSTA4_TX9_LENGTH                                  0x1
#define _TXSTA4_TX9_MASK                                    0x40
#define _TXSTA4_CSRC_POSN                                   0x7
#define _TXSTA4_CSRC_POSITION                               0x7
#define _TXSTA4_CSRC_SIZE                                   0x1
#define _TXSTA4_CSRC_LENGTH                                 0x1
#define _TXSTA4_CSRC_MASK                                   0x80
#define _TXSTA4_TXD84_POSN                                  0x0
#define _TXSTA4_TXD84_POSITION                              0x0
#define _TXSTA4_TXD84_SIZE                                  0x1
#define _TXSTA4_TXD84_LENGTH                                0x1
#define _TXSTA4_TXD84_MASK                                  0x1
#define _TXSTA4_TX8_94_POSN                                 0x6
#define _TXSTA4_TX8_94_POSITION                             0x6
#define _TXSTA4_TX8_94_SIZE                                 0x1
#define _TXSTA4_TX8_94_LENGTH                               0x1
#define _TXSTA4_TX8_94_MASK                                 0x40

