MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile RCSTA3bits_t RCSTA3bits __at(0xF2F);
// bitfield macros
#define _RCSTA3_RX9D_POSN                                   0x0
#define _RCSTA3_RX9D_POSITION                               0x0
#define _RCSTA3_RX9D_SIZE                                   0x1
#define _RCSTA3_RX9D_LENGTH                                 0x1
#define _RCSTA3_RX9D_MASK                                   0x1
#define _RCSTA3_OERR_POSN                                   0x1
#define _RCSTA3_OERR_POSITION                               0x1
#define _RCSTA3_OERR_SIZE                                   0x1
#define _RCSTA3_OERR_LENGTH                                 0x1
#define _RCSTA3_OERR_MASK                                   0x2
#define _RCSTA3_FERR_POSN                                   0x2
#define _RCSTA3_FERR_POSITION                               0x2
#define _RCSTA3_FERR_SIZE                                   0x1
#define _RCSTA3_FERR_LENGTH                                 0x1
#define _RCSTA3_FERR_MASK                                   0x4
#define _RCSTA3_ADDEN_POSN                                  0x3
#define _RCSTA3_ADDEN_POSITION                              0x3
#define _RCSTA3_ADDEN_SIZE                                  0x1
#define _RCSTA3_ADDEN_LENGTH                                0x1
#define _RCSTA3_ADDEN_MASK                                  0x8
#define _RCSTA3_CREN_POSN                                   0x4
#define _RCSTA3_CREN_POSITION                               0x4
#define _RCSTA3_CREN_SIZE                                   0x1
#define _RCSTA3_CREN_LENGTH                                 0x1
#define _RCSTA3_CREN_MASK                                   0x10
#define _RCSTA3_SREN_POSN                                   0x5
#define _RCSTA3_SREN_POSITION                               0x5
#define _RCSTA3_SREN_SIZE                                   0x1
#define _RCSTA3_SREN_LENGTH                                 0x1
#define _RCSTA3_SREN_MASK                                   0x20
#define _RCSTA3_RX9_POSN                                    0x6
#define _RCSTA3_RX9_POSITION                                0x6
#define _RCSTA3_RX9_SIZE                                    0x1
#define _RCSTA3_RX9_LENGTH                                  0x1
#define _RCSTA3_RX9_MASK                                    0x40
#define _RCSTA3_SPEN_POSN                                   0x7
#define _RCSTA3_SPEN_POSITION                               0x7
#define _RCSTA3_SPEN_SIZE                                   0x1
#define _RCSTA3_SPEN_LENGTH                                 0x1
#define _RCSTA3_SPEN_MASK                                   0x80
#define _RCSTA3_RCD83_POSN                                  0x0
#define _RCSTA3_RCD83_POSITION                              0x0
#define _RCSTA3_RCD83_SIZE                                  0x1
#define _RCSTA3_RCD83_LENGTH                                0x1
#define _RCSTA3_RCD83_MASK                                  0x1
#define _RCSTA3_RC8_92_POSN                                 0x6
#define _RCSTA3_RC8_92_POSITION                             0x6
#define _RCSTA3_RC8_92_SIZE                                 0x1
#define _RCSTA3_RC8_92_LENGTH                               0x1
#define _RCSTA3_RC8_92_MASK                                 0x40
#define _RCSTA3_RC93_POSN                                   0x6
#define _RCSTA3_RC93_POSITION                               0x6
#define _RCSTA3_RC93_SIZE                                   0x1
#define _RCSTA3_RC93_LENGTH                                 0x1
#define _RCSTA3_RC93_MASK                                   0x40

// Register: SPBRGH1
#define SPBRGH1 SPBRGH1
extern volatile unsigned char           SPBRGH1             __at(0xF30);
#ifndef _LIB_BUILD
asm("SPBRGH1 equ 0F30h");
#endif
// aliases
extern volatile unsigned char           SPBRGH              __at(0xF30);
#ifndef _LIB_BUILD
asm("SPBRGH equ 0F30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH1                :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SPBRGH1bits_t;
extern volatile SPBRGH1bits_t SPBRGH1bits __at(0xF30);
// bitfield macros
#define _SPBRGH1_SPBRGH1_POSN                               0x0
#define _SPBRGH1_SPBRGH1_POSITION                           0x0
#define _SPBRGH1_SPBRGH1_SIZE                               0x8
#define _SPBRGH1_SPBRGH1_LENGTH                             0x8
#define _SPBRGH1_SPBRGH1_MASK                               0xFF
#define _SPBRGH1_BRG8_POSN                                  0x0
#define _SPBRGH1_BRG8_POSITION                              0x0
#define _SPBRGH1_BRG8_SIZE                                  0x1
#define _SPBRGH1_BRG8_LENGTH                                0x1
#define _SPBRGH1_BRG8_MASK                                  0x1
#define _SPBRGH1_BRG9_POSN                                  0x1
#define _SPBRGH1_BRG9_POSITION                              0x1
#define _SPBRGH1_BRG9_SIZE                                  0x1
#define _SPBRGH1_BRG9_LENGTH                                0x1
#define _SPBRGH1_BRG9_MASK                                  0x2
#define _SPBRGH1_BRG10_POSN                                 0x2
#define _SPBRGH1_BRG10_POSITION                             0x2
#define _SPBRGH1_BRG10_SIZE                                 0x1
#define _SPBRGH1_BRG10_LENGTH                               0x1
#define _SPBRGH1_BRG10_MASK                                 0x4
#define _SPBRGH1_BRG11_POSN                                 0x3
#define _SPBRGH1_BRG11_POSITION                             0x3
#define _SPBRGH1_BRG11_SIZE                                 0x1
#define _SPBRGH1_BRG11_LENGTH                               0x1
#define _SPBRGH1_BRG11_MASK                                 0x8
#define _SPBRGH1_BRG12_POSN                                 0x4
#define _SPBRGH1_BRG12_POSITION                             0x4
#define _SPBRGH1_BRG12_SIZE                                 0x1
#define _SPBRGH1_BRG12_LENGTH                               0x1
#define _SPBRGH1_BRG12_MASK                                 0x10
#define _SPBRGH1_BRG13_POSN                                 0x5
#define _SPBRGH1_BRG13_POSITION                             0x5
#define _SPBRGH1_BRG13_SIZE                                 0x1
#define _SPBRGH1_BRG13_LENGTH                               0x1
#define _SPBRGH1_BRG13_MASK                                 0x20
#define _SPBRGH1_BRG14_POSN                                 0x6
#define _SPBRGH1_BRG14_POSITION                             0x6
#define _SPBRGH1_BRG14_SIZE                                 0x1
#define _SPBRGH1_BRG14_LENGTH                               0x1
#define _SPBRGH1_BRG14_MASK                                 0x40
#define _SPBRGH1_BRG15_POSN                                 0x7
#define _SPBRGH1_BRG15_POSITION                             0x7
#define _SPBRGH1_BRG15_SIZE                                 0x1
#define _SPBRGH1_BRG15_LENGTH                               0x1
#define _SPBRGH1_BRG15_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH1                :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SPBRGHbits_t;
extern volatile SPBRGHbits_t SPBRGHbits __at(0xF30);
// bitfield macros
#define _SPBRGH_SPBRGH1_POSN                                0x0
#define _SPBRGH_SPBRGH1_POSITION                            0x0
#define _SPBRGH_SPBRGH1_SIZE                                0x8
#define _SPBRGH_SPBRGH1_LENGTH                              0x8
#define _SPBRGH_SPBRGH1_MASK                                0xFF
#define _SPBRGH_BRG8_POSN                                   0x0
#define _SPBRGH_BRG8_POSITION                               0x0
#define _SPBRGH_BRG8_SIZE                                   0x1
#define _SPBRGH_BRG8_LENGTH                                 0x1
#define _SPBRGH_BRG8_MASK                                   0x1
#define _SPBRGH_BRG9_POSN                                   0x1
#define _SPBRGH_BRG9_POSITION                               0x1
#define _SPBRGH_BRG9_SIZE                                   0x1
#define _SPBRGH_BRG9_LENGTH                                 0x1
#define _SPBRGH_BRG9_MASK                                   0x2
#define _SPBRGH_BRG10_POSN                                  0x2
#define _SPBRGH_BRG10_POSITION                              0x2
#define _SPBRGH_BRG10_SIZE                                  0x1
#define _SPBRGH_BRG10_LENGTH                                0x1
#define _SPBRGH_BRG10_MASK                                  0x4
#define _SPBRGH_BRG11_POSN                                  0x3
#define _SPBRGH_BRG11_POSITION                              0x3
#define _SPBRGH_BRG11_SIZE                                  0x1
#define _SPBRGH_BRG11_LENGTH                                0x1
#define _SPBRGH_BRG11_MASK                                  0x8
#define _SPBRGH_BRG12_POSN                                  0x4
#define _SPBRGH_BRG12_POSITION                              0x4
#define _SPBRGH_BRG12_SIZE                                  0x1
#define _SPBRGH_BRG12_LENGTH                                0x1
#define _SPBRGH_BRG12_MASK                                  0x10
#define _SPBRGH_BRG13_POSN                                  0x5
#define _SPBRGH_BRG13_POSITION                              0x5
#define _SPBRGH_BRG13_SIZE                                  0x1
#define _SPBRGH_BRG13_LENGTH                                0x1
#define _SPBRGH_BRG13_MASK                                  0x20
#define _SPBRGH_BRG14_POSN                                  0x6
#define _SPBRGH_BRG14_POSITION                              0x6
#define _SPBRGH_BRG14_SIZE                                  0x1
#define _SPBRGH_BRG14_LENGTH                                0x1
#define _SPBRGH_BRG14_MASK                                  0x40
#define _SPBRGH_BRG15_POSN                                  0x7
#define _SPBRGH_BRG15_POSITION                              0x7
#define _SPBRGH_BRG15_SIZE                                  0x1
#define _SPBRGH_BRG15_LENGTH                                0x1
#define _SPBRGH_BRG15_MASK                                  0x80

// Register: BAUDCON2
#define BAUDCON2 BAUDCON2
extern volatile unsigned char           BAUDCON2            __at(0xF31);
#ifndef _LIB_BUILD
asm("BAUDCON2 equ 0F31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned IREN                   :1;
        unsigned BRG16                  :1;
        unsigned TXCKP                  :1;
        unsigned RXDTP                  :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN2                 :1;
        unsigned WUE2                   :1;
        unsigned                        :1;
        unsigned BRG162                 :1;
        unsigned SCKP2                  :1;
        unsigned DTRXP2                 :1;
        unsigned RCIDL2                 :1;
        unsigned ABDOVF2                :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP2                 :1;
        unsigned RXDTP2                 :1;
        unsigned RCMT2                  :1;
    };
} BAUDCON2bits_t;
