MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
#define                                 IOC0R0_bit          _BIT_ACCESS(RPINR18_19,0)
// RPINR18_19<IOC0R1>
extern volatile __bit                   IOC0R1              __at(0x7199);	// @ (0xE33 * 8 + 1)
#define                                 IOC0R1_bit          _BIT_ACCESS(RPINR18_19,1)
// RPINR18_19<IOC0R2>
extern volatile __bit                   IOC0R2              __at(0x719A);	// @ (0xE33 * 8 + 2)
#define                                 IOC0R2_bit          _BIT_ACCESS(RPINR18_19,2)
// RPINR18_19<IOC0R3>
extern volatile __bit                   IOC0R3              __at(0x719B);	// @ (0xE33 * 8 + 3)
#define                                 IOC0R3_bit          _BIT_ACCESS(RPINR18_19,3)
// RPINR18_19<IOC1R0>
extern volatile __bit                   IOC1R0              __at(0x719C);	// @ (0xE33 * 8 + 4)
#define                                 IOC1R0_bit          _BIT_ACCESS(RPINR18_19,4)
// RPINR18_19<IOC1R1>
extern volatile __bit                   IOC1R1              __at(0x719D);	// @ (0xE33 * 8 + 5)
#define                                 IOC1R1_bit          _BIT_ACCESS(RPINR18_19,5)
// RPINR18_19<IOC1R2>
extern volatile __bit                   IOC1R2              __at(0x719E);	// @ (0xE33 * 8 + 6)
#define                                 IOC1R2_bit          _BIT_ACCESS(RPINR18_19,6)
// RPINR18_19<IOC1R3>
extern volatile __bit                   IOC1R3              __at(0x719F);	// @ (0xE33 * 8 + 7)
#define                                 IOC1R3_bit          _BIT_ACCESS(RPINR18_19,7)
// RPINR20_21<IOC2R0>
extern volatile __bit                   IOC2R0              __at(0x71A0);	// @ (0xE34 * 8 + 0)
#define                                 IOC2R0_bit          _BIT_ACCESS(RPINR20_21,0)
// RPINR20_21<IOC2R1>
extern volatile __bit                   IOC2R1              __at(0x71A1);	// @ (0xE34 * 8 + 1)
#define                                 IOC2R1_bit          _BIT_ACCESS(RPINR20_21,1)
// RPINR20_21<IOC2R2>
extern volatile __bit                   IOC2R2              __at(0x71A2);	// @ (0xE34 * 8 + 2)
#define                                 IOC2R2_bit          _BIT_ACCESS(RPINR20_21,2)
// RPINR20_21<IOC2R3>
extern volatile __bit                   IOC2R3              __at(0x71A3);	// @ (0xE34 * 8 + 3)
#define                                 IOC2R3_bit          _BIT_ACCESS(RPINR20_21,3)
// RPINR20_21<IOC3R0>
extern volatile __bit                   IOC3R0              __at(0x71A4);	// @ (0xE34 * 8 + 4)
#define                                 IOC3R0_bit          _BIT_ACCESS(RPINR20_21,4)
// RPINR20_21<IOC3R1>
extern volatile __bit                   IOC3R1              __at(0x71A5);	// @ (0xE34 * 8 + 5)
#define                                 IOC3R1_bit          _BIT_ACCESS(RPINR20_21,5)
// RPINR20_21<IOC3R2>
extern volatile __bit                   IOC3R2              __at(0x71A6);	// @ (0xE34 * 8 + 6)
#define                                 IOC3R2_bit          _BIT_ACCESS(RPINR20_21,6)
// RPINR20_21<IOC3R3>
extern volatile __bit                   IOC3R3              __at(0x71A7);	// @ (0xE34 * 8 + 7)
#define                                 IOC3R3_bit          _BIT_ACCESS(RPINR20_21,7)
// RPINR22_23<IOC4R0>
extern volatile __bit                   IOC4R0              __at(0x71A8);	// @ (0xE35 * 8 + 0)
#define                                 IOC4R0_bit          _BIT_ACCESS(RPINR22_23,0)
// RPINR22_23<IOC4R1>
extern volatile __bit                   IOC4R1              __at(0x71A9);	// @ (0xE35 * 8 + 1)
#define                                 IOC4R1_bit          _BIT_ACCESS(RPINR22_23,1)
// RPINR22_23<IOC4R2>
extern volatile __bit                   IOC4R2              __at(0x71AA);	// @ (0xE35 * 8 + 2)
#define                                 IOC4R2_bit          _BIT_ACCESS(RPINR22_23,2)
// RPINR22_23<IOC4R3>
extern volatile __bit                   IOC4R3              __at(0x71AB);	// @ (0xE35 * 8 + 3)
#define                                 IOC4R3_bit          _BIT_ACCESS(RPINR22_23,3)
// RPINR22_23<IOC5R0>
extern volatile __bit                   IOC5R0              __at(0x71AC);	// @ (0xE35 * 8 + 4)
#define                                 IOC5R0_bit          _BIT_ACCESS(RPINR22_23,4)
// RPINR22_23<IOC5R1>
extern volatile __bit                   IOC5R1              __at(0x71AD);	// @ (0xE35 * 8 + 5)
#define                                 IOC5R1_bit          _BIT_ACCESS(RPINR22_23,5)
// RPINR22_23<IOC5R2>
extern volatile __bit                   IOC5R2              __at(0x71AE);	// @ (0xE35 * 8 + 6)
#define                                 IOC5R2_bit          _BIT_ACCESS(RPINR22_23,6)
// RPINR22_23<IOC5R3>
extern volatile __bit                   IOC5R3              __at(0x71AF);	// @ (0xE35 * 8 + 7)
#define                                 IOC5R3_bit          _BIT_ACCESS(RPINR22_23,7)
// RPINR24_25<IOC6R0>
extern volatile __bit                   IOC6R0              __at(0x71B0);	// @ (0xE36 * 8 + 0)
#define                                 IOC6R0_bit          _BIT_ACCESS(RPINR24_25,0)
// RPINR24_25<IOC6R1>
extern volatile __bit                   IOC6R1              __at(0x71B1);	// @ (0xE36 * 8 + 1)
#define                                 IOC6R1_bit          _BIT_ACCESS(RPINR24_25,1)
// RPINR24_25<IOC6R2>
extern volatile __bit                   IOC6R2              __at(0x71B2);	// @ (0xE36 * 8 + 2)
#define                                 IOC6R2_bit          _BIT_ACCESS(RPINR24_25,2)
// RPINR24_25<IOC6R3>
extern volatile __bit                   IOC6R3              __at(0x71B3);	// @ (0xE36 * 8 + 3)
#define                                 IOC6R3_bit          _BIT_ACCESS(RPINR24_25,3)
// RPINR24_25<IOC7R0>
extern volatile __bit                   IOC7R0              __at(0x71B4);	// @ (0xE36 * 8 + 4)
#define                                 IOC7R0_bit          _BIT_ACCESS(RPINR24_25,4)
// RPINR24_25<IOC7R1>
extern volatile __bit                   IOC7R1              __at(0x71B5);	// @ (0xE36 * 8 + 5)
#define                                 IOC7R1_bit          _BIT_ACCESS(RPINR24_25,5)
// RPINR24_25<IOC7R2>
extern volatile __bit                   IOC7R2              __at(0x71B6);	// @ (0xE36 * 8 + 6)
#define                                 IOC7R2_bit          _BIT_ACCESS(RPINR24_25,6)
// RPINR24_25<IOC7R3>
extern volatile __bit                   IOC7R3              __at(0x71B7);	// @ (0xE36 * 8 + 7)
#define                                 IOC7R3_bit          _BIT_ACCESS(RPINR24_25,7)
// IOCF<IOCF0>
extern volatile __bit                   IOCF0               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 IOCF0_bit           _BIT_ACCESS(IOCF,0)
// IOCF<IOCF1>
extern volatile __bit                   IOCF1               __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 IOCF1_bit           _BIT_ACCESS(IOCF,1)
// IOCF<IOCF2>
extern volatile __bit                   IOCF2               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 IOCF2_bit           _BIT_ACCESS(IOCF,2)
// IOCF<IOCF3>
extern volatile __bit                   IOCF3               __at(0x7E8B);	// @ (0xFD1 * 8 + 3)
#define                                 IOCF3_bit           _BIT_ACCESS(IOCF,3)
// IOCF<IOCF4>
extern volatile __bit                   IOCF4               __at(0x7E8C);	// @ (0xFD1 * 8 + 4)
#define                                 IOCF4_bit           _BIT_ACCESS(IOCF,4)
// IOCF<IOCF5>
extern volatile __bit                   IOCF5               __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 IOCF5_bit           _BIT_ACCESS(IOCF,5)
// IOCF<IOCF6>
extern volatile __bit                   IOCF6               __at(0x7E8E);	// @ (0xFD1 * 8 + 6)
#define                                 IOCF6_bit           _BIT_ACCESS(IOCF,6)
// IOCF<IOCF7>
extern volatile __bit                   IOCF7               __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 IOCF7_bit           _BIT_ACCESS(IOCF,7)
// INTCON<IOCIE>
extern volatile __bit                   IOCIE               __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 IOCIE_bit           _BIT_ACCESS(INTCON,3)
// INTCON<IOCIF>
extern volatile __bit                   IOCIF               __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 IOCIF_bit           _BIT_ACCESS(INTCON,0)
// INTCON2<IOCIP>
extern volatile __bit                   IOCIP               __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 IOCIP_bit           _BIT_ACCESS(INTCON2,0)
// PMD4<IOCMD>
extern volatile __bit                   IOCMD               __at(0x7783);	// @ (0xEF0 * 8 + 3)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD4,3)
// IOCN<IOCN0>
extern volatile __bit                   IOCN0               __at(0x7AA8);	// @ (0xF55 * 8 + 0)
#define                                 IOCN0_bit           _BIT_ACCESS(IOCN,0)
// IOCN<IOCN1>
extern volatile __bit                   IOCN1               __at(0x7AA9);	// @ (0xF55 * 8 + 1)
#define                                 IOCN1_bit           _BIT_ACCESS(IOCN,1)
// IOCN<IOCN2>
extern volatile __bit                   IOCN2               __at(0x7AAA);	// @ (0xF55 * 8 + 2)
#define                                 IOCN2_bit           _BIT_ACCESS(IOCN,2)
// IOCN<IOCN3>
extern volatile __bit                   IOCN3               __at(0x7AAB);	// @ (0xF55 * 8 + 3)
#define                                 IOCN3_bit           _BIT_ACCESS(IOCN,3)
// IOCN<IOCN4>
extern volatile __bit                   IOCN4               __at(0x7AAC);	// @ (0xF55 * 8 + 4)
#define                                 IOCN4_bit           _BIT_ACCESS(IOCN,4)
// IOCN<IOCN5>
extern volatile __bit                   IOCN5               __at(0x7AAD);	// @ (0xF55 * 8 + 5)
#define                                 IOCN5_bit           _BIT_ACCESS(IOCN,5)
// IOCN<IOCN6>
extern volatile __bit                   IOCN6               __at(0x7AAE);	// @ (0xF55 * 8 + 6)
#define                                 IOCN6_bit           _BIT_ACCESS(IOCN,6)
// IOCN<IOCN7>
extern volatile __bit                   IOCN7               __at(0x7AAF);	// @ (0xF55 * 8 + 7)
#define                                 IOCN7_bit           _BIT_ACCESS(IOCN,7)
// IOCP<IOCP0>
extern volatile __bit                   IOCP0               __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 IOCP0_bit           _BIT_ACCESS(IOCP,0)
// IOCP<IOCP1>
extern volatile __bit                   IOCP1               __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 IOCP1_bit           _BIT_ACCESS(IOCP,1)
// IOCP<IOCP2>
extern volatile __bit                   IOCP2               __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 IOCP2_bit           _BIT_ACCESS(IOCP,2)
// IOCP<IOCP3>
extern volatile __bit                   IOCP3               __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 IOCP3_bit           _BIT_ACCESS(IOCP,3)
// IOCP<IOCP4>
extern volatile __bit                   IOCP4               __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 IOCP4_bit           _BIT_ACCESS(IOCP,4)
// IOCP<IOCP5>
extern volatile __bit                   IOCP5               __at(0x7AB5);	// @ (0xF56 * 8 + 5)
#define                                 IOCP5_bit           _BIT_ACCESS(IOCP,5)
// IOCP<IOCP6>
extern volatile __bit                   IOCP6               __at(0x7AB6);	// @ (0xF56 * 8 + 6)
#define                                 IOCP6_bit           _BIT_ACCESS(IOCP,6)
// IOCP<IOCP7>
extern volatile __bit                   IOCP7               __at(0x7AB7);	// @ (0xF56 * 8 + 7)
#define                                 IOCP7_bit           _BIT_ACCESS(IOCP,7)
// OSCCON2<IOLOCK>
extern volatile __bit                   IOLOCK              __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 IOLOCK_bit          _BIT_ACCESS(OSCCON2,6)
// RCON<IPEN>
extern volatile __bit                   IPEN                __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 IPEN_bit            _BIT_ACCESS(RCON,7)
// OSCCON3<IRCF0>
extern volatile __bit                   IRCF0               __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON3,0)
// OSCCON3<IRCF1>
extern volatile __bit                   IRCF1               __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON3,1)
// OSCCON3<IRCF2>
extern volatile __bit                   IRCF2               __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON3,2)
// CTMUCON2<IRNG0>
extern volatile __bit                   IRNG0               __at(0x77B8);	// @ (0xEF7 * 8 + 0)
#define                                 IRNG0_bit           _BIT_ACCESS(CTMUCON2,0)
// CTMUCON2<IRNG1>
extern volatile __bit                   IRNG1               __at(0x77B9);	// @ (0xEF7 * 8 + 1)
#define                                 IRNG1_bit           _BIT_ACCESS(CTMUCON2,1)
// HLVDCON<IRVST>
extern volatile __bit                   IRVST               __at(0x7D45);	// @ (0xFA8 * 8 + 5)
#define                                 IRVST_bit           _BIT_ACCESS(HLVDCON,5)
// CTMUCON2<ITRIM0>
extern volatile __bit                   ITRIM0              __at(0x77BA);	// @ (0xEF7 * 8 + 2)
#define                                 ITRIM0_bit          _BIT_ACCESS(CTMUCON2,2)
// CTMUCON2<ITRIM1>
extern volatile __bit                   ITRIM1              __at(0x77BB);	// @ (0xEF7 * 8 + 3)
#define                                 ITRIM1_bit          _BIT_ACCESS(CTMUCON2,3)
// CTMUCON2<ITRIM2>
extern volatile __bit                   ITRIM2              __at(0x77BC);	// @ (0xEF7 * 8 + 4)
#define                                 ITRIM2_bit          _BIT_ACCESS(CTMUCON2,4)
// CTMUCON2<ITRIM3>
extern volatile __bit                   ITRIM3              __at(0x77BD);	// @ (0xEF7 * 8 + 5)
#define                                 ITRIM3_bit          _BIT_ACCESS(CTMUCON2,5)
// CTMUCON2<ITRIM4>
extern volatile __bit                   ITRIM4              __at(0x77BE);	// @ (0xEF7 * 8 + 6)
#define                                 ITRIM4_bit          _BIT_ACCESS(CTMUCON2,6)
// CTMUCON2<ITRIM5>
extern volatile __bit                   ITRIM5              __at(0x77BF);	// @ (0xEF7 * 8 + 7)
#define                                 ITRIM5_bit          _BIT_ACCESS(CTMUCON2,7)
// LATA<LA0>
extern volatile __bit                   LA0                 __at(0x7C48);	// @ (0xF89 * 8 + 0)
#define                                 LA0_bit             _BIT_ACCESS(LATA,0)
// LATA<LA1>
extern volatile __bit                   LA1                 __at(0x7C49);	// @ (0xF89 * 8 + 1)
#define                                 LA1_bit             _BIT_ACCESS(LATA,1)
// LATA<LA2>
extern volatile __bit                   LA2                 __at(0x7C4A);	// @ (0xF89 * 8 + 2)
#define                                 LA2_bit             _BIT_ACCESS(LATA,2)
// LATA<LA3>
extern volatile __bit                   LA3                 __at(0x7C4B);	// @ (0xF89 * 8 + 3)
#define                                 LA3_bit             _BIT_ACCESS(LATA,3)
// LATA<LA4>
extern volatile __bit                   LA4                 __at(0x7C4C);	// @ (0xF89 * 8 + 4)
#define                                 LA4_bit             _BIT_ACCESS(LATA,4)
// LATA<LA5>
extern volatile __bit                   LA5                 __at(0x7C4D);	// @ (0xF89 * 8 + 5)
#define                                 LA5_bit             _BIT_ACCESS(LATA,5)
// LATA<LA6>
extern volatile __bit                   LA6                 __at(0x7C4E);	// @ (0xF89 * 8 + 6)
#define                                 LA6_bit             _BIT_ACCESS(LATA,6)
// LATA<LA7>
extern volatile __bit                   LA7                 __at(0x7C4F);	// @ (0xF89 * 8 + 7)
#define                                 LA7_bit             _BIT_ACCESS(LATA,7)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x7C48);	// @ (0xF89 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x7C49);	// @ (0xF89 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x7C4A);	// @ (0xF89 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0x7C4B);	// @ (0xF89 * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x7C4C);	// @ (0xF89 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x7C4D);	// @ (0xF89 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x7C4E);	// @ (0xF89 * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x7C4F);	// @ (0xF89 * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x7C50);	// @ (0xF8A * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x7C51);	// @ (0xF8A * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x7C52);	// @ (0xF8A * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x7C54);	// @ (0xF8A * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x7C55);	// @ (0xF8A * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x7C56);	// @ (0xF8A * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x7C57);	// @ (0xF8A * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x7C58);	// @ (0xF8B * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x7C59);	// @ (0xF8B * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x7C5A);	// @ (0xF8B * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x7C5B);	// @ (0xF8B * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x7C5C);	// @ (0xF8B * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x7C5D);	// @ (0xF8B * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x7C5E);	// @ (0xF8B * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x7C5F);	// @ (0xF8B * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATD<LATD0>
extern volatile __bit                   LATD0               __at(0x7C60);	// @ (0xF8C * 8 + 0)
#define                                 LATD0_bit           _BIT_ACCESS(LATD,0)
// LATD<LATD1>
extern volatile __bit                   LATD1               __at(0x7C61);	// @ (0xF8C * 8 + 1)
#define                                 LATD1_bit           _BIT_ACCESS(LATD,1)
// LATD<LATD2>
extern volatile __bit                   LATD2               __at(0x7C62);	// @ (0xF8C * 8 + 2)
#define                                 LATD2_bit           _BIT_ACCESS(LATD,2)
// LATD<LATD3>
extern volatile __bit                   LATD3               __at(0x7C63);	// @ (0xF8C * 8 + 3)
#define                                 LATD3_bit           _BIT_ACCESS(LATD,3)
// LATD<LATD4>
extern volatile __bit                   LATD4               __at(0x7C64);	// @ (0xF8C * 8 + 4)
#define                                 LATD4_bit           _BIT_ACCESS(LATD,4)
// LATD<LATD5>
extern volatile __bit                   LATD5               __at(0x7C65);	// @ (0xF8C * 8 + 5)
#define                                 LATD5_bit           _BIT_ACCESS(LATD,5)
// LATD<LATD6>
extern volatile __bit                   LATD6               __at(0x7C66);	// @ (0xF8C * 8 + 6)
#define                                 LATD6_bit           _BIT_ACCESS(LATD,6)
// LATD<LATD7>
extern volatile __bit                   LATD7               __at(0x7C67);	// @ (0xF8C * 8 + 7)
#define                                 LATD7_bit           _BIT_ACCESS(LATD,7)
// LATE<LATE0>
extern volatile __bit                   LATE0               __at(0x7C68);	// @ (0xF8D * 8 + 0)
#define                                 LATE0_bit           _BIT_ACCESS(LATE,0)
// LATE<LATE1>
extern volatile __bit                   LATE1               __at(0x7C69);	// @ (0xF8D * 8 + 1)
#define                                 LATE1_bit           _BIT_ACCESS(LATE,1)
// LATE<LATE2>
extern volatile __bit                   LATE2               __at(0x7C6A);	// @ (0xF8D * 8 + 2)
#define                                 LATE2_bit           _BIT_ACCESS(LATE,2)
// LATE<LATE3>
extern volatile __bit                   LATE3               __at(0x7C6B);	// @ (0xF8D * 8 + 3)
#define                                 LATE3_bit           _BIT_ACCESS(LATE,3)
// LATE<LATE4>
extern volatile __bit                   LATE4               __at(0x7C6C);	// @ (0xF8D * 8 + 4)
#define                                 LATE4_bit           _BIT_ACCESS(LATE,4)
// LATE<LATE5>
extern volatile __bit                   LATE5               __at(0x7C6D);	// @ (0xF8D * 8 + 5)
#define                                 LATE5_bit           _BIT_ACCESS(LATE,5)
// LATE<LATE6>
extern volatile __bit                   LATE6               __at(0x7C6E);	// @ (0xF8D * 8 + 6)
#define                                 LATE6_bit           _BIT_ACCESS(LATE,6)
// LATE<LATE7>
extern volatile __bit                   LATE7               __at(0x7C6F);	// @ (0xF8D * 8 + 7)
#define                                 LATE7_bit           _BIT_ACCESS(LATE,7)
// LATF<LATF2>
extern volatile __bit                   LATF2               __at(0x7C72);	// @ (0xF8E * 8 + 2)
#define                                 LATF2_bit           _BIT_ACCESS(LATF,2)
// LATF<LATF3>
extern volatile __bit                   LATF3               __at(0x7C73);	// @ (0xF8E * 8 + 3)
#define                                 LATF3_bit           _BIT_ACCESS(LATF,3)
// LATF<LATF4>
