MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
#define                                 P2M0_bit            _BIT_ACCESS(CCP2CON,6)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x7A77);	// @ (0xF4E * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// ECCP2DEL<P2RSEN>
extern volatile __bit                   P2RSEN              __at(0x7A8F);	// @ (0xF51 * 8 + 7)
#define                                 P2RSEN_bit          _BIT_ACCESS(ECCP2DEL,7)
// ECCP3DEL<P3DC0>
extern volatile __bit                   P3DC0               __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 P3DC0_bit           _BIT_ACCESS(ECCP3DEL,0)
// PSTR3CON<P3DC02>
extern volatile __bit                   P3DC02              __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P3DC02_bit          _BIT_ACCESS(PSTR3CON,0)
// PSTR3CON<P3DC0CON>
extern volatile __bit                   P3DC0CON            __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P3DC0CON_bit        _BIT_ACCESS(PSTR3CON,0)
// ECCP3DEL<P3DC1>
extern volatile __bit                   P3DC1               __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 P3DC1_bit           _BIT_ACCESS(ECCP3DEL,1)
// PSTR3CON<P3DC12>
extern volatile __bit                   P3DC12              __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P3DC12_bit          _BIT_ACCESS(PSTR3CON,1)
// PSTR3CON<P3DC1CON>
extern volatile __bit                   P3DC1CON            __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P3DC1CON_bit        _BIT_ACCESS(PSTR3CON,1)
// ECCP3DEL<P3DC2>
extern volatile __bit                   P3DC2               __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 P3DC2_bit           _BIT_ACCESS(ECCP3DEL,2)
// PSTR3CON<P3DC22>
extern volatile __bit                   P3DC22              __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P3DC22_bit          _BIT_ACCESS(PSTR3CON,2)
// PSTR3CON<P3DC2CON>
extern volatile __bit                   P3DC2CON            __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P3DC2CON_bit        _BIT_ACCESS(PSTR3CON,2)
// ECCP3DEL<P3DC3>
extern volatile __bit                   P3DC3               __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 P3DC3_bit           _BIT_ACCESS(ECCP3DEL,3)
// PSTR3CON<P3DC32>
extern volatile __bit                   P3DC32              __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P3DC32_bit          _BIT_ACCESS(PSTR3CON,3)
// PSTR3CON<P3DC3CON>
extern volatile __bit                   P3DC3CON            __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P3DC3CON_bit        _BIT_ACCESS(PSTR3CON,3)
// ECCP3DEL<P3DC4>
extern volatile __bit                   P3DC4               __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 P3DC4_bit           _BIT_ACCESS(ECCP3DEL,4)
// PSTR3CON<P3DC42>
extern volatile __bit                   P3DC42              __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P3DC42_bit          _BIT_ACCESS(PSTR3CON,4)
// PSTR3CON<P3DC4CON>
extern volatile __bit                   P3DC4CON            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P3DC4CON_bit        _BIT_ACCESS(PSTR3CON,4)
// ECCP3DEL<P3DC5>
extern volatile __bit                   P3DC5               __at(0x7A65);	// @ (0xF4C * 8 + 5)
#define                                 P3DC5_bit           _BIT_ACCESS(ECCP3DEL,5)
// ECCP3DEL<P3DC6>
extern volatile __bit                   P3DC6               __at(0x7A66);	// @ (0xF4C * 8 + 6)
#define                                 P3DC6_bit           _BIT_ACCESS(ECCP3DEL,6)
// PSTR3CON<P3DC62>
extern volatile __bit                   P3DC62              __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 P3DC62_bit          _BIT_ACCESS(PSTR3CON,6)
// PSTR3CON<P3DC6CON>
extern volatile __bit                   P3DC6CON            __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 P3DC6CON_bit        _BIT_ACCESS(PSTR3CON,6)
// CCP3CON<P3M0>
extern volatile __bit                   P3M0                __at(0x7A4E);	// @ (0xF49 * 8 + 6)
#define                                 P3M0_bit            _BIT_ACCESS(CCP3CON,6)
// CCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 P3M1_bit            _BIT_ACCESS(CCP3CON,7)
// ECCP3DEL<P3RSEN>
extern volatile __bit                   P3RSEN              __at(0x7A67);	// @ (0xF4C * 8 + 7)
#define                                 P3RSEN_bit          _BIT_ACCESS(ECCP3DEL,7)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PA2E>
extern volatile __bit                   PA2E                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PA2E_bit            _BIT_ACCESS(PORTE,7)
// PORTH<PB1>
extern volatile __bit                   PB1                 __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 PB1_bit             _BIT_ACCESS(PORTH,7)
// PORTE<PB1E>
extern volatile __bit                   PB1E                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 PB1E_bit            _BIT_ACCESS(PORTE,6)
// PORTE<PB2>
extern volatile __bit                   PB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTH<PB3>
extern volatile __bit                   PB3                 __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 PB3_bit             _BIT_ACCESS(PORTH,5)
// PORTE<PB3E>
extern volatile __bit                   PB3E                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 PB3E_bit            _BIT_ACCESS(PORTE,4)
// RPINR46_47<PBIO0R0>
extern volatile __bit                   PBIO0R0             __at(0x7208);	// @ (0xE41 * 8 + 0)
#define                                 PBIO0R0_bit         _BIT_ACCESS(RPINR46_47,0)
// RPINR46_47<PBIO0R1>
extern volatile __bit                   PBIO0R1             __at(0x7209);	// @ (0xE41 * 8 + 1)
#define                                 PBIO0R1_bit         _BIT_ACCESS(RPINR46_47,1)
// RPINR46_47<PBIO0R2>
extern volatile __bit                   PBIO0R2             __at(0x720A);	// @ (0xE41 * 8 + 2)
#define                                 PBIO0R2_bit         _BIT_ACCESS(RPINR46_47,2)
// RPINR46_47<PBIO0R3>
extern volatile __bit                   PBIO0R3             __at(0x720B);	// @ (0xE41 * 8 + 3)
#define                                 PBIO0R3_bit         _BIT_ACCESS(RPINR46_47,3)
// RPINR46_47<PBIO1R0>
extern volatile __bit                   PBIO1R0             __at(0x720C);	// @ (0xE41 * 8 + 4)
#define                                 PBIO1R0_bit         _BIT_ACCESS(RPINR46_47,4)
// RPINR46_47<PBIO1R1>
extern volatile __bit                   PBIO1R1             __at(0x720D);	// @ (0xE41 * 8 + 5)
#define                                 PBIO1R1_bit         _BIT_ACCESS(RPINR46_47,5)
// RPINR46_47<PBIO1R2>
extern volatile __bit                   PBIO1R2             __at(0x720E);	// @ (0xE41 * 8 + 6)
#define                                 PBIO1R2_bit         _BIT_ACCESS(RPINR46_47,6)
// RPINR46_47<PBIO1R3>
extern volatile __bit                   PBIO1R3             __at(0x720F);	// @ (0xE41 * 8 + 7)
#define                                 PBIO1R3_bit         _BIT_ACCESS(RPINR46_47,7)
// RPINR48_49<PBIO2R0>
extern volatile __bit                   PBIO2R0             __at(0x7210);	// @ (0xE42 * 8 + 0)
#define                                 PBIO2R0_bit         _BIT_ACCESS(RPINR48_49,0)
// RPINR48_49<PBIO2R1>
extern volatile __bit                   PBIO2R1             __at(0x7211);	// @ (0xE42 * 8 + 1)
#define                                 PBIO2R1_bit         _BIT_ACCESS(RPINR48_49,1)
// RPINR48_49<PBIO2R2>
extern volatile __bit                   PBIO2R2             __at(0x7212);	// @ (0xE42 * 8 + 2)
#define                                 PBIO2R2_bit         _BIT_ACCESS(RPINR48_49,2)
// RPINR48_49<PBIO2R3>
extern volatile __bit                   PBIO2R3             __at(0x7213);	// @ (0xE42 * 8 + 3)
#define                                 PBIO2R3_bit         _BIT_ACCESS(RPINR48_49,3)
// RPINR48_49<PBIO3R0>
extern volatile __bit                   PBIO3R0             __at(0x7214);	// @ (0xE42 * 8 + 4)
#define                                 PBIO3R0_bit         _BIT_ACCESS(RPINR48_49,4)
// RPINR48_49<PBIO3R1>
extern volatile __bit                   PBIO3R1             __at(0x7215);	// @ (0xE42 * 8 + 5)
#define                                 PBIO3R1_bit         _BIT_ACCESS(RPINR48_49,5)
// RPINR48_49<PBIO3R2>
extern volatile __bit                   PBIO3R2             __at(0x7216);	// @ (0xE42 * 8 + 6)
#define                                 PBIO3R2_bit         _BIT_ACCESS(RPINR48_49,6)
// RPINR48_49<PBIO3R3>
extern volatile __bit                   PBIO3R3             __at(0x7217);	// @ (0xE42 * 8 + 7)
#define                                 PBIO3R3_bit         _BIT_ACCESS(RPINR48_49,7)
// RPINR50_51<PBIO4R0>
extern volatile __bit                   PBIO4R0             __at(0x7218);	// @ (0xE43 * 8 + 0)
#define                                 PBIO4R0_bit         _BIT_ACCESS(RPINR50_51,0)
// RPINR50_51<PBIO4R1>
extern volatile __bit                   PBIO4R1             __at(0x7219);	// @ (0xE43 * 8 + 1)
#define                                 PBIO4R1_bit         _BIT_ACCESS(RPINR50_51,1)
// RPINR50_51<PBIO4R2>
extern volatile __bit                   PBIO4R2             __at(0x721A);	// @ (0xE43 * 8 + 2)
#define                                 PBIO4R2_bit         _BIT_ACCESS(RPINR50_51,2)
// RPINR50_51<PBIO4R3>
extern volatile __bit                   PBIO4R3             __at(0x721B);	// @ (0xE43 * 8 + 3)
#define                                 PBIO4R3_bit         _BIT_ACCESS(RPINR50_51,3)
// RPINR50_51<PBIO5R0>
extern volatile __bit                   PBIO5R0             __at(0x721C);	// @ (0xE43 * 8 + 4)
#define                                 PBIO5R0_bit         _BIT_ACCESS(RPINR50_51,4)
// RPINR50_51<PBIO5R1>
extern volatile __bit                   PBIO5R1             __at(0x721D);	// @ (0xE43 * 8 + 5)
#define                                 PBIO5R1_bit         _BIT_ACCESS(RPINR50_51,5)
// RPINR50_51<PBIO5R2>
extern volatile __bit                   PBIO5R2             __at(0x721E);	// @ (0xE43 * 8 + 6)
#define                                 PBIO5R2_bit         _BIT_ACCESS(RPINR50_51,6)
// RPINR50_51<PBIO5R3>
extern volatile __bit                   PBIO5R3             __at(0x721F);	// @ (0xE43 * 8 + 7)
#define                                 PBIO5R3_bit         _BIT_ACCESS(RPINR50_51,7)
// RPINR52_53<PBIO6R0>
extern volatile __bit                   PBIO6R0             __at(0x7220);	// @ (0xE44 * 8 + 0)
#define                                 PBIO6R0_bit         _BIT_ACCESS(RPINR52_53,0)
// RPINR52_53<PBIO6R1>
extern volatile __bit                   PBIO6R1             __at(0x7221);	// @ (0xE44 * 8 + 1)
#define                                 PBIO6R1_bit         _BIT_ACCESS(RPINR52_53,1)
// RPINR52_53<PBIO6R2>
extern volatile __bit                   PBIO6R2             __at(0x7222);	// @ (0xE44 * 8 + 2)
#define                                 PBIO6R2_bit         _BIT_ACCESS(RPINR52_53,2)
// RPINR52_53<PBIO6R3>
extern volatile __bit                   PBIO6R3             __at(0x7223);	// @ (0xE44 * 8 + 3)
#define                                 PBIO6R3_bit         _BIT_ACCESS(RPINR52_53,3)
// RPINR52_53<PBIO7R0>
extern volatile __bit                   PBIO7R0             __at(0x7224);	// @ (0xE44 * 8 + 4)
#define                                 PBIO7R0_bit         _BIT_ACCESS(RPINR52_53,4)
// RPINR52_53<PBIO7R1>
extern volatile __bit                   PBIO7R1             __at(0x7225);	// @ (0xE44 * 8 + 5)
#define                                 PBIO7R1_bit         _BIT_ACCESS(RPINR52_53,5)
// RPINR52_53<PBIO7R2>
extern volatile __bit                   PBIO7R2             __at(0x7226);	// @ (0xE44 * 8 + 6)
#define                                 PBIO7R2_bit         _BIT_ACCESS(RPINR52_53,6)
// RPINR52_53<PBIO7R3>
extern volatile __bit                   PBIO7R3             __at(0x7227);	// @ (0xE44 * 8 + 7)
#define                                 PBIO7R3_bit         _BIT_ACCESS(RPINR52_53,7)
// PORTH<PC1>
extern volatile __bit                   PC1                 __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 PC1_bit             _BIT_ACCESS(PORTH,6)
// PORTE<PC1E>
extern volatile __bit                   PC1E                __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 PC1E_bit            _BIT_ACCESS(PORTE,5)
// PORTE<PC2>
extern volatile __bit                   PC2                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// PORTH<PC3>
extern volatile __bit                   PC3                 __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 PC3_bit             _BIT_ACCESS(PORTH,4)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// ANCON1<PCFG10>
extern volatile __bit                   PCFG10              __at(0x723A);	// @ (0xE47 * 8 + 2)
#define                                 PCFG10_bit          _BIT_ACCESS(ANCON1,2)
// ANCON1<PCFG11>
extern volatile __bit                   PCFG11              __at(0x723B);	// @ (0xE47 * 8 + 3)
#define                                 PCFG11_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<PCFG12>
extern volatile __bit                   PCFG12              __at(0x723C);	// @ (0xE47 * 8 + 4)
#define                                 PCFG12_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<PCFG13>
extern volatile __bit                   PCFG13              __at(0x723D);	// @ (0xE47 * 8 + 5)
#define                                 PCFG13_bit          _BIT_ACCESS(ANCON1,5)
// ANCON1<PCFG14>
extern volatile __bit                   PCFG14              __at(0x723E);	// @ (0xE47 * 8 + 6)
#define                                 PCFG14_bit          _BIT_ACCESS(ANCON1,6)
// ANCON1<PCFG15>
extern volatile __bit                   PCFG15              __at(0x723F);	// @ (0xE47 * 8 + 7)
#define                                 PCFG15_bit          _BIT_ACCESS(ANCON1,7)
// ANCON2<PCFG16>
extern volatile __bit                   PCFG16              __at(0x7230);	// @ (0xE46 * 8 + 0)
#define                                 PCFG16_bit          _BIT_ACCESS(ANCON2,0)
// ANCON2<PCFG17>
extern volatile __bit                   PCFG17              __at(0x7231);	// @ (0xE46 * 8 + 1)
#define                                 PCFG17_bit          _BIT_ACCESS(ANCON2,1)
// ANCON2<PCFG18>
extern volatile __bit                   PCFG18              __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 PCFG18_bit          _BIT_ACCESS(ANCON2,2)
// ANCON2<PCFG19>
extern volatile __bit                   PCFG19              __at(0x7233);	// @ (0xE46 * 8 + 3)
#define                                 PCFG19_bit          _BIT_ACCESS(ANCON2,3)
// ANCON2<PCFG20>
extern volatile __bit                   PCFG20              __at(0x7234);	// @ (0xE46 * 8 + 4)
#define                                 PCFG20_bit          _BIT_ACCESS(ANCON2,4)
// ANCON2<PCFG21>
extern volatile __bit                   PCFG21              __at(0x7235);	// @ (0xE46 * 8 + 5)
#define                                 PCFG21_bit          _BIT_ACCESS(ANCON2,5)
// ANCON2<PCFG22>
extern volatile __bit                   PCFG22              __at(0x7236);	// @ (0xE46 * 8 + 6)
#define                                 PCFG22_bit          _BIT_ACCESS(ANCON2,6)
// ANCON2<PCFG23>
extern volatile __bit                   PCFG23              __at(0x7237);	// @ (0xE46 * 8 + 7)
#define                                 PCFG23_bit          _BIT_ACCESS(ANCON2,7)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7238);	// @ (0xE47 * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7239);	// @ (0xE47 * 8 + 1)
#define                                 PCFG9_bit           _BIT_ACCESS(ANCON1,1)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// PORTE<PD2>
extern volatile __bit                   PD2                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PD2_bit             _BIT_ACCESS(PORTE,0)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// UEIE<PIDEE>
extern volatile __bit                   PIDEE               __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PIDEE_bit           _BIT_ACCESS(UEIE,0)
// UEIR<PIDEF>
extern volatile __bit                   PIDEF               __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 PIDEF_bit           _BIT_ACCESS(UEIR,0)
// UCON<PKTDIS>
extern volatile __bit                   PKTDIS              __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 PKTDIS_bit          _BIT_ACCESS(UCON,4)
// OSCCON4<PLLEN>
extern volatile __bit                   PLLEN               __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCCON4,5)
// PADCFG1<PMPTTL>
extern volatile __bit                   PMPTTL              __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 PMPTTL_bit          _BIT_ACCESS(PADCFG1,0)
// RCON4<PMSLP>
extern volatile __bit                   PMSLP               __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 PMSLP_bit           _BIT_ACCESS(RCON4,0)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// OSCCON2<POSCEN>
extern volatile __bit                   POSCEN              __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 POSCEN_bit          _BIT_ACCESS(OSCCON2,2)
// UCFG<PPB0>
extern volatile __bit                   PPB0                __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 PPB0_bit            _BIT_ACCESS(UCFG,0)
// UCFG<PPB1>
extern volatile __bit                   PPB1                __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 PPB1_bit            _BIT_ACCESS(UCFG,1)
// USTAT<PPBI>
extern volatile __bit                   PPBI                __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 PPBI_bit            _BIT_ACCESS(USTAT,1)
// UCON<PPBRST>
extern volatile __bit                   PPBRST              __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 PPBRST_bit          _BIT_ACCESS(UCON,6)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// PMD3<PSPMD>
extern volatile __bit                   PSPMD               __at(0x778A);	// @ (0xEF1 * 8 + 2)
#define                                 PSPMD_bit           _BIT_ACCESS(PMD3,2)
// PSPCON<PSPMODE>
extern volatile __bit                   PSPMODE             __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 PSPMODE_bit         _BIT_ACCESS(PSPCON,4)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7A92);	// @ (0xF52 * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7A93);	// @ (0xF52 * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7A90);	// @ (0xF52 * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7A91);	// @ (0xF52 * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// ECCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x7A6A);	// @ (0xF4D * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(ECCP3AS,2)
// ECCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(ECCP3AS,3)
// ECCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(ECCP3AS,0)
// ECCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(ECCP3AS,1)
// ADCON3H<PUMPEN>
