MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
// RPOR0_1<RPO0R0>
extern volatile __bit                   RPO0R0              __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 RPO0R0_bit          _BIT_ACCESS(RPOR0_1,0)
// RPOR0_1<RPO0R1>
extern volatile __bit                   RPO0R1              __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 RPO0R1_bit          _BIT_ACCESS(RPOR0_1,1)
// RPOR0_1<RPO0R2>
extern volatile __bit                   RPO0R2              __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 RPO0R2_bit          _BIT_ACCESS(RPOR0_1,2)
// RPOR0_1<RPO0R3>
extern volatile __bit                   RPO0R3              __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 RPO0R3_bit          _BIT_ACCESS(RPOR0_1,3)
// RPOR10_11<RPO10R0>
extern volatile __bit                   RPO10R0             __at(0x70B8);	// @ (0xE17 * 8 + 0)
#define                                 RPO10R0_bit         _BIT_ACCESS(RPOR10_11,0)
// RPOR10_11<RPO10R1>
extern volatile __bit                   RPO10R1             __at(0x70B9);	// @ (0xE17 * 8 + 1)
#define                                 RPO10R1_bit         _BIT_ACCESS(RPOR10_11,1)
// RPOR10_11<RPO10R2>
extern volatile __bit                   RPO10R2             __at(0x70BA);	// @ (0xE17 * 8 + 2)
#define                                 RPO10R2_bit         _BIT_ACCESS(RPOR10_11,2)
// RPOR10_11<RPO10R3>
extern volatile __bit                   RPO10R3             __at(0x70BB);	// @ (0xE17 * 8 + 3)
#define                                 RPO10R3_bit         _BIT_ACCESS(RPOR10_11,3)
// RPOR10_11<RPO11R0>
extern volatile __bit                   RPO11R0             __at(0x70BC);	// @ (0xE17 * 8 + 4)
#define                                 RPO11R0_bit         _BIT_ACCESS(RPOR10_11,4)
// RPOR10_11<RPO11R1>
extern volatile __bit                   RPO11R1             __at(0x70BD);	// @ (0xE17 * 8 + 5)
#define                                 RPO11R1_bit         _BIT_ACCESS(RPOR10_11,5)
// RPOR10_11<RPO11R2>
extern volatile __bit                   RPO11R2             __at(0x70BE);	// @ (0xE17 * 8 + 6)
#define                                 RPO11R2_bit         _BIT_ACCESS(RPOR10_11,6)
// RPOR10_11<RPO11R3>
extern volatile __bit                   RPO11R3             __at(0x70BF);	// @ (0xE17 * 8 + 7)
#define                                 RPO11R3_bit         _BIT_ACCESS(RPOR10_11,7)
// RPOR12_13<RPO12R0>
extern volatile __bit                   RPO12R0             __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 RPO12R0_bit         _BIT_ACCESS(RPOR12_13,0)
// RPOR12_13<RPO12R1>
extern volatile __bit                   RPO12R1             __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 RPO12R1_bit         _BIT_ACCESS(RPOR12_13,1)
// RPOR12_13<RPO12R2>
extern volatile __bit                   RPO12R2             __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 RPO12R2_bit         _BIT_ACCESS(RPOR12_13,2)
// RPOR12_13<RPO12R3>
extern volatile __bit                   RPO12R3             __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 RPO12R3_bit         _BIT_ACCESS(RPOR12_13,3)
// RPOR12_13<RPO13R0>
extern volatile __bit                   RPO13R0             __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 RPO13R0_bit         _BIT_ACCESS(RPOR12_13,4)
// RPOR12_13<RPO13R1>
extern volatile __bit                   RPO13R1             __at(0x70C5);	// @ (0xE18 * 8 + 5)
#define                                 RPO13R1_bit         _BIT_ACCESS(RPOR12_13,5)
// RPOR12_13<RPO13R2>
extern volatile __bit                   RPO13R2             __at(0x70C6);	// @ (0xE18 * 8 + 6)
#define                                 RPO13R2_bit         _BIT_ACCESS(RPOR12_13,6)
// RPOR12_13<RPO13R3>
extern volatile __bit                   RPO13R3             __at(0x70C7);	// @ (0xE18 * 8 + 7)
#define                                 RPO13R3_bit         _BIT_ACCESS(RPOR12_13,7)
// RPOR14_15<RPO14R0>
extern volatile __bit                   RPO14R0             __at(0x70C8);	// @ (0xE19 * 8 + 0)
#define                                 RPO14R0_bit         _BIT_ACCESS(RPOR14_15,0)
// RPOR14_15<RPO14R1>
extern volatile __bit                   RPO14R1             __at(0x70C9);	// @ (0xE19 * 8 + 1)
#define                                 RPO14R1_bit         _BIT_ACCESS(RPOR14_15,1)
// RPOR14_15<RPO14R2>
extern volatile __bit                   RPO14R2             __at(0x70CA);	// @ (0xE19 * 8 + 2)
#define                                 RPO14R2_bit         _BIT_ACCESS(RPOR14_15,2)
// RPOR14_15<RPO14R3>
extern volatile __bit                   RPO14R3             __at(0x70CB);	// @ (0xE19 * 8 + 3)
#define                                 RPO14R3_bit         _BIT_ACCESS(RPOR14_15,3)
// RPOR14_15<RPO15R0>
extern volatile __bit                   RPO15R0             __at(0x70CC);	// @ (0xE19 * 8 + 4)
#define                                 RPO15R0_bit         _BIT_ACCESS(RPOR14_15,4)
// RPOR14_15<RPO15R1>
extern volatile __bit                   RPO15R1             __at(0x70CD);	// @ (0xE19 * 8 + 5)
#define                                 RPO15R1_bit         _BIT_ACCESS(RPOR14_15,5)
// RPOR14_15<RPO15R2>
extern volatile __bit                   RPO15R2             __at(0x70CE);	// @ (0xE19 * 8 + 6)
#define                                 RPO15R2_bit         _BIT_ACCESS(RPOR14_15,6)
// RPOR14_15<RPO15R3>
extern volatile __bit                   RPO15R3             __at(0x70CF);	// @ (0xE19 * 8 + 7)
#define                                 RPO15R3_bit         _BIT_ACCESS(RPOR14_15,7)
// RPOR16_17<RPO16R0>
extern volatile __bit                   RPO16R0             __at(0x70D0);	// @ (0xE1A * 8 + 0)
#define                                 RPO16R0_bit         _BIT_ACCESS(RPOR16_17,0)
// RPOR16_17<RPO16R1>
extern volatile __bit                   RPO16R1             __at(0x70D1);	// @ (0xE1A * 8 + 1)
#define                                 RPO16R1_bit         _BIT_ACCESS(RPOR16_17,1)
// RPOR16_17<RPO16R2>
extern volatile __bit                   RPO16R2             __at(0x70D2);	// @ (0xE1A * 8 + 2)
#define                                 RPO16R2_bit         _BIT_ACCESS(RPOR16_17,2)
// RPOR16_17<RPO16R3>
extern volatile __bit                   RPO16R3             __at(0x70D3);	// @ (0xE1A * 8 + 3)
#define                                 RPO16R3_bit         _BIT_ACCESS(RPOR16_17,3)
// RPOR16_17<RPO17R0>
extern volatile __bit                   RPO17R0             __at(0x70D4);	// @ (0xE1A * 8 + 4)
#define                                 RPO17R0_bit         _BIT_ACCESS(RPOR16_17,4)
// RPOR16_17<RPO17R1>
extern volatile __bit                   RPO17R1             __at(0x70D5);	// @ (0xE1A * 8 + 5)
#define                                 RPO17R1_bit         _BIT_ACCESS(RPOR16_17,5)
// RPOR16_17<RPO17R2>
extern volatile __bit                   RPO17R2             __at(0x70D6);	// @ (0xE1A * 8 + 6)
#define                                 RPO17R2_bit         _BIT_ACCESS(RPOR16_17,6)
// RPOR16_17<RPO17R3>
extern volatile __bit                   RPO17R3             __at(0x70D7);	// @ (0xE1A * 8 + 7)
#define                                 RPO17R3_bit         _BIT_ACCESS(RPOR16_17,7)
// RPOR18_19<RPO18R0>
extern volatile __bit                   RPO18R0             __at(0x70D8);	// @ (0xE1B * 8 + 0)
#define                                 RPO18R0_bit         _BIT_ACCESS(RPOR18_19,0)
// RPOR18_19<RPO18R1>
extern volatile __bit                   RPO18R1             __at(0x70D9);	// @ (0xE1B * 8 + 1)
#define                                 RPO18R1_bit         _BIT_ACCESS(RPOR18_19,1)
// RPOR18_19<RPO18R2>
extern volatile __bit                   RPO18R2             __at(0x70DA);	// @ (0xE1B * 8 + 2)
#define                                 RPO18R2_bit         _BIT_ACCESS(RPOR18_19,2)
// RPOR18_19<RPO18R3>
extern volatile __bit                   RPO18R3             __at(0x70DB);	// @ (0xE1B * 8 + 3)
#define                                 RPO18R3_bit         _BIT_ACCESS(RPOR18_19,3)
// RPOR18_19<RPO19R0>
extern volatile __bit                   RPO19R0             __at(0x70DC);	// @ (0xE1B * 8 + 4)
#define                                 RPO19R0_bit         _BIT_ACCESS(RPOR18_19,4)
// RPOR18_19<RPO19R1>
extern volatile __bit                   RPO19R1             __at(0x70DD);	// @ (0xE1B * 8 + 5)
#define                                 RPO19R1_bit         _BIT_ACCESS(RPOR18_19,5)
// RPOR18_19<RPO19R2>
extern volatile __bit                   RPO19R2             __at(0x70DE);	// @ (0xE1B * 8 + 6)
#define                                 RPO19R2_bit         _BIT_ACCESS(RPOR18_19,6)
// RPOR18_19<RPO19R3>
extern volatile __bit                   RPO19R3             __at(0x70DF);	// @ (0xE1B * 8 + 7)
#define                                 RPO19R3_bit         _BIT_ACCESS(RPOR18_19,7)
// RPOR0_1<RPO1R0>
extern volatile __bit                   RPO1R0              __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 RPO1R0_bit          _BIT_ACCESS(RPOR0_1,4)
// RPOR0_1<RPO1R1>
extern volatile __bit                   RPO1R1              __at(0x7095);	// @ (0xE12 * 8 + 5)
#define                                 RPO1R1_bit          _BIT_ACCESS(RPOR0_1,5)
// RPOR0_1<RPO1R2>
extern volatile __bit                   RPO1R2              __at(0x7096);	// @ (0xE12 * 8 + 6)
#define                                 RPO1R2_bit          _BIT_ACCESS(RPOR0_1,6)
// RPOR0_1<RPO1R3>
extern volatile __bit                   RPO1R3              __at(0x7097);	// @ (0xE12 * 8 + 7)
#define                                 RPO1R3_bit          _BIT_ACCESS(RPOR0_1,7)
// RPOR20_21<RPO20R0>
extern volatile __bit                   RPO20R0             __at(0x70E0);	// @ (0xE1C * 8 + 0)
#define                                 RPO20R0_bit         _BIT_ACCESS(RPOR20_21,0)
// RPOR20_21<RPO20R1>
extern volatile __bit                   RPO20R1             __at(0x70E1);	// @ (0xE1C * 8 + 1)
#define                                 RPO20R1_bit         _BIT_ACCESS(RPOR20_21,1)
// RPOR20_21<RPO20R2>
extern volatile __bit                   RPO20R2             __at(0x70E2);	// @ (0xE1C * 8 + 2)
#define                                 RPO20R2_bit         _BIT_ACCESS(RPOR20_21,2)
// RPOR20_21<RPO20R3>
extern volatile __bit                   RPO20R3             __at(0x70E3);	// @ (0xE1C * 8 + 3)
#define                                 RPO20R3_bit         _BIT_ACCESS(RPOR20_21,3)
// RPOR20_21<RPO21R0>
extern volatile __bit                   RPO21R0             __at(0x70E4);	// @ (0xE1C * 8 + 4)
#define                                 RPO21R0_bit         _BIT_ACCESS(RPOR20_21,4)
// RPOR20_21<RPO21R1>
extern volatile __bit                   RPO21R1             __at(0x70E5);	// @ (0xE1C * 8 + 5)
#define                                 RPO21R1_bit         _BIT_ACCESS(RPOR20_21,5)
// RPOR20_21<RPO21R2>
extern volatile __bit                   RPO21R2             __at(0x70E6);	// @ (0xE1C * 8 + 6)
#define                                 RPO21R2_bit         _BIT_ACCESS(RPOR20_21,6)
// RPOR20_21<RPO21R3>
extern volatile __bit                   RPO21R3             __at(0x70E7);	// @ (0xE1C * 8 + 7)
#define                                 RPO21R3_bit         _BIT_ACCESS(RPOR20_21,7)
// RPOR22_23<RPO22R0>
extern volatile __bit                   RPO22R0             __at(0x70E8);	// @ (0xE1D * 8 + 0)
#define                                 RPO22R0_bit         _BIT_ACCESS(RPOR22_23,0)
// RPOR22_23<RPO22R1>
extern volatile __bit                   RPO22R1             __at(0x70E9);	// @ (0xE1D * 8 + 1)
#define                                 RPO22R1_bit         _BIT_ACCESS(RPOR22_23,1)
// RPOR22_23<RPO22R2>
extern volatile __bit                   RPO22R2             __at(0x70EA);	// @ (0xE1D * 8 + 2)
#define                                 RPO22R2_bit         _BIT_ACCESS(RPOR22_23,2)
// RPOR22_23<RPO22R3>
extern volatile __bit                   RPO22R3             __at(0x70EB);	// @ (0xE1D * 8 + 3)
#define                                 RPO22R3_bit         _BIT_ACCESS(RPOR22_23,3)
// RPOR22_23<RPO23R0>
extern volatile __bit                   RPO23R0             __at(0x70EC);	// @ (0xE1D * 8 + 4)
#define                                 RPO23R0_bit         _BIT_ACCESS(RPOR22_23,4)
// RPOR22_23<RPO23R1>
extern volatile __bit                   RPO23R1             __at(0x70ED);	// @ (0xE1D * 8 + 5)
#define                                 RPO23R1_bit         _BIT_ACCESS(RPOR22_23,5)
// RPOR22_23<RPO23R2>
extern volatile __bit                   RPO23R2             __at(0x70EE);	// @ (0xE1D * 8 + 6)
#define                                 RPO23R2_bit         _BIT_ACCESS(RPOR22_23,6)
// RPOR22_23<RPO23R3>
extern volatile __bit                   RPO23R3             __at(0x70EF);	// @ (0xE1D * 8 + 7)
#define                                 RPO23R3_bit         _BIT_ACCESS(RPOR22_23,7)
// RPOR24_25<RPO24R0>
extern volatile __bit                   RPO24R0             __at(0x70F0);	// @ (0xE1E * 8 + 0)
#define                                 RPO24R0_bit         _BIT_ACCESS(RPOR24_25,0)
// RPOR24_25<RPO24R1>
extern volatile __bit                   RPO24R1             __at(0x70F1);	// @ (0xE1E * 8 + 1)
#define                                 RPO24R1_bit         _BIT_ACCESS(RPOR24_25,1)
// RPOR24_25<RPO24R2>
extern volatile __bit                   RPO24R2             __at(0x70F2);	// @ (0xE1E * 8 + 2)
#define                                 RPO24R2_bit         _BIT_ACCESS(RPOR24_25,2)
// RPOR24_25<RPO24R3>
extern volatile __bit                   RPO24R3             __at(0x70F3);	// @ (0xE1E * 8 + 3)
#define                                 RPO24R3_bit         _BIT_ACCESS(RPOR24_25,3)
// RPOR24_25<RPO25R0>
extern volatile __bit                   RPO25R0             __at(0x70F4);	// @ (0xE1E * 8 + 4)
#define                                 RPO25R0_bit         _BIT_ACCESS(RPOR24_25,4)
// RPOR24_25<RPO25R1>
extern volatile __bit                   RPO25R1             __at(0x70F5);	// @ (0xE1E * 8 + 5)
#define                                 RPO25R1_bit         _BIT_ACCESS(RPOR24_25,5)
// RPOR24_25<RPO25R2>
extern volatile __bit                   RPO25R2             __at(0x70F6);	// @ (0xE1E * 8 + 6)
#define                                 RPO25R2_bit         _BIT_ACCESS(RPOR24_25,6)
// RPOR24_25<RPO25R3>
extern volatile __bit                   RPO25R3             __at(0x70F7);	// @ (0xE1E * 8 + 7)
#define                                 RPO25R3_bit         _BIT_ACCESS(RPOR24_25,7)
// RPOR26_27<RPO26R0>
extern volatile __bit                   RPO26R0             __at(0x70F8);	// @ (0xE1F * 8 + 0)
#define                                 RPO26R0_bit         _BIT_ACCESS(RPOR26_27,0)
// RPOR26_27<RPO26R1>
extern volatile __bit                   RPO26R1             __at(0x70F9);	// @ (0xE1F * 8 + 1)
#define                                 RPO26R1_bit         _BIT_ACCESS(RPOR26_27,1)
// RPOR26_27<RPO26R2>
extern volatile __bit                   RPO26R2             __at(0x70FA);	// @ (0xE1F * 8 + 2)
#define                                 RPO26R2_bit         _BIT_ACCESS(RPOR26_27,2)
// RPOR26_27<RPO26R3>
extern volatile __bit                   RPO26R3             __at(0x70FB);	// @ (0xE1F * 8 + 3)
#define                                 RPO26R3_bit         _BIT_ACCESS(RPOR26_27,3)
// RPOR26_27<RPO27R0>
extern volatile __bit                   RPO27R0             __at(0x70FC);	// @ (0xE1F * 8 + 4)
#define                                 RPO27R0_bit         _BIT_ACCESS(RPOR26_27,4)
// RPOR26_27<RPO27R1>
extern volatile __bit                   RPO27R1             __at(0x70FD);	// @ (0xE1F * 8 + 5)
#define                                 RPO27R1_bit         _BIT_ACCESS(RPOR26_27,5)
// RPOR26_27<RPO27R2>
extern volatile __bit                   RPO27R2             __at(0x70FE);	// @ (0xE1F * 8 + 6)
#define                                 RPO27R2_bit         _BIT_ACCESS(RPOR26_27,6)
// RPOR26_27<RPO27R3>
extern volatile __bit                   RPO27R3             __at(0x70FF);	// @ (0xE1F * 8 + 7)
#define                                 RPO27R3_bit         _BIT_ACCESS(RPOR26_27,7)
// RPOR28_29<RPO28R0>
extern volatile __bit                   RPO28R0             __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 RPO28R0_bit         _BIT_ACCESS(RPOR28_29,0)
// RPOR28_29<RPO28R1>
extern volatile __bit                   RPO28R1             __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 RPO28R1_bit         _BIT_ACCESS(RPOR28_29,1)
// RPOR28_29<RPO28R2>
extern volatile __bit                   RPO28R2             __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 RPO28R2_bit         _BIT_ACCESS(RPOR28_29,2)
// RPOR28_29<RPO28R3>
extern volatile __bit                   RPO28R3             __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 RPO28R3_bit         _BIT_ACCESS(RPOR28_29,3)
// RPOR28_29<RPO29R0>
extern volatile __bit                   RPO29R0             __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 RPO29R0_bit         _BIT_ACCESS(RPOR28_29,4)
// RPOR28_29<RPO29R1>
extern volatile __bit                   RPO29R1             __at(0x7105);	// @ (0xE20 * 8 + 5)
#define                                 RPO29R1_bit         _BIT_ACCESS(RPOR28_29,5)
// RPOR28_29<RPO29R2>
extern volatile __bit                   RPO29R2             __at(0x7106);	// @ (0xE20 * 8 + 6)
#define                                 RPO29R2_bit         _BIT_ACCESS(RPOR28_29,6)
// RPOR28_29<RPO29R3>
extern volatile __bit                   RPO29R3             __at(0x7107);	// @ (0xE20 * 8 + 7)
#define                                 RPO29R3_bit         _BIT_ACCESS(RPOR28_29,7)
// RPOR2_3<RPO2R0>
extern volatile __bit                   RPO2R0              __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 RPO2R0_bit          _BIT_ACCESS(RPOR2_3,0)
// RPOR2_3<RPO2R1>
extern volatile __bit                   RPO2R1              __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 RPO2R1_bit          _BIT_ACCESS(RPOR2_3,1)
// RPOR2_3<RPO2R2>
extern volatile __bit                   RPO2R2              __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 RPO2R2_bit          _BIT_ACCESS(RPOR2_3,2)
// RPOR2_3<RPO2R3>
extern volatile __bit                   RPO2R3              __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 RPO2R3_bit          _BIT_ACCESS(RPOR2_3,3)
// RPOR30_31<RPO30R0>
extern volatile __bit                   RPO30R0             __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 RPO30R0_bit         _BIT_ACCESS(RPOR30_31,0)
// RPOR30_31<RPO30R1>
extern volatile __bit                   RPO30R1             __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 RPO30R1_bit         _BIT_ACCESS(RPOR30_31,1)
// RPOR30_31<RPO30R2>
extern volatile __bit                   RPO30R2             __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 RPO30R2_bit         _BIT_ACCESS(RPOR30_31,2)
// RPOR30_31<RPO30R3>
extern volatile __bit                   RPO30R3             __at(0x710B);	// @ (0xE21 * 8 + 3)
#define                                 RPO30R3_bit         _BIT_ACCESS(RPOR30_31,3)
// RPOR30_31<RPO31R0>
extern volatile __bit                   RPO31R0             __at(0x710C);	// @ (0xE21 * 8 + 4)
#define                                 RPO31R0_bit         _BIT_ACCESS(RPOR30_31,4)
// RPOR30_31<RPO31R1>
extern volatile __bit                   RPO31R1             __at(0x710D);	// @ (0xE21 * 8 + 5)
#define                                 RPO31R1_bit         _BIT_ACCESS(RPOR30_31,5)
// RPOR30_31<RPO31R2>
extern volatile __bit                   RPO31R2             __at(0x710E);	// @ (0xE21 * 8 + 6)
#define                                 RPO31R2_bit         _BIT_ACCESS(RPOR30_31,6)
// RPOR30_31<RPO31R3>
extern volatile __bit                   RPO31R3             __at(0x710F);	// @ (0xE21 * 8 + 7)
#define                                 RPO31R3_bit         _BIT_ACCESS(RPOR30_31,7)
// RPOR32_33<RPO32R0>
extern volatile __bit                   RPO32R0             __at(0x7110);	// @ (0xE22 * 8 + 0)
#define                                 RPO32R0_bit         _BIT_ACCESS(RPOR32_33,0)
// RPOR32_33<RPO32R1>
extern volatile __bit                   RPO32R1             __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 RPO32R1_bit         _BIT_ACCESS(RPOR32_33,1)
// RPOR32_33<RPO32R2>
extern volatile __bit                   RPO32R2             __at(0x7112);	// @ (0xE22 * 8 + 2)
#define                                 RPO32R2_bit         _BIT_ACCESS(RPOR32_33,2)
// RPOR32_33<RPO32R3>
extern volatile __bit                   RPO32R3             __at(0x7113);	// @ (0xE22 * 8 + 3)
#define                                 RPO32R3_bit         _BIT_ACCESS(RPOR32_33,3)
// RPOR32_33<RPO33R0>
extern volatile __bit                   RPO33R0             __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 RPO33R0_bit         _BIT_ACCESS(RPOR32_33,4)
// RPOR32_33<RPO33R1>
extern volatile __bit                   RPO33R1             __at(0x7115);	// @ (0xE22 * 8 + 5)
#define                                 RPO33R1_bit         _BIT_ACCESS(RPOR32_33,5)
// RPOR32_33<RPO33R2>
extern volatile __bit                   RPO33R2             __at(0x7116);	// @ (0xE22 * 8 + 6)
#define                                 RPO33R2_bit         _BIT_ACCESS(RPOR32_33,6)
// RPOR32_33<RPO33R3>
extern volatile __bit                   RPO33R3             __at(0x7117);	// @ (0xE22 * 8 + 7)
#define                                 RPO33R3_bit         _BIT_ACCESS(RPOR32_33,7)
// RPOR34_35<RPO34R0>
extern volatile __bit                   RPO34R0             __at(0x7118);	// @ (0xE23 * 8 + 0)
#define                                 RPO34R0_bit         _BIT_ACCESS(RPOR34_35,0)
// RPOR34_35<RPO34R1>
extern volatile __bit                   RPO34R1             __at(0x7119);	// @ (0xE23 * 8 + 1)
#define                                 RPO34R1_bit         _BIT_ACCESS(RPOR34_35,1)
// RPOR34_35<RPO34R2>
extern volatile __bit                   RPO34R2             __at(0x711A);	// @ (0xE23 * 8 + 2)
#define                                 RPO34R2_bit         _BIT_ACCESS(RPOR34_35,2)
// RPOR34_35<RPO34R3>
extern volatile __bit                   RPO34R3             __at(0x711B);	// @ (0xE23 * 8 + 3)
#define                                 RPO34R3_bit         _BIT_ACCESS(RPOR34_35,3)
// RPOR34_35<RPO35R0>
extern volatile __bit                   RPO35R0             __at(0x711C);	// @ (0xE23 * 8 + 4)
#define                                 RPO35R0_bit         _BIT_ACCESS(RPOR34_35,4)
// RPOR34_35<RPO35R1>
extern volatile __bit                   RPO35R1             __at(0x711D);	// @ (0xE23 * 8 + 5)
#define                                 RPO35R1_bit         _BIT_ACCESS(RPOR34_35,5)
// RPOR34_35<RPO35R2>
extern volatile __bit                   RPO35R2             __at(0x711E);	// @ (0xE23 * 8 + 6)
#define                                 RPO35R2_bit         _BIT_ACCESS(RPOR34_35,6)
// RPOR34_35<RPO35R3>
extern volatile __bit                   RPO35R3             __at(0x711F);	// @ (0xE23 * 8 + 7)
#define                                 RPO35R3_bit         _BIT_ACCESS(RPOR34_35,7)
// RPOR36_37<RPO36R0>
extern volatile __bit                   RPO36R0             __at(0x7120);	// @ (0xE24 * 8 + 0)
#define                                 RPO36R0_bit         _BIT_ACCESS(RPOR36_37,0)
// RPOR36_37<RPO36R1>
extern volatile __bit                   RPO36R1             __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 RPO36R1_bit         _BIT_ACCESS(RPOR36_37,1)
// RPOR36_37<RPO36R2>
extern volatile __bit                   RPO36R2             __at(0x7122);	// @ (0xE24 * 8 + 2)
#define                                 RPO36R2_bit         _BIT_ACCESS(RPOR36_37,2)
// RPOR36_37<RPO36R3>
