MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J94/mcu.h
extern volatile __bit                   S14C4               __at(0x757E);	// @ (0xEAF * 8 + 6)
#define                                 S14C4_bit           _BIT_ACCESS(LCDDATA33,6)
// LCDDATA41<S14C5>
extern volatile __bit                   S14C5               __at(0x75BE);	// @ (0xEB7 * 8 + 6)
#define                                 S14C5_bit           _BIT_ACCESS(LCDDATA41,6)
// LCDDATA49<S14C6>
extern volatile __bit                   S14C6               __at(0x75FE);	// @ (0xEBF * 8 + 6)
#define                                 S14C6_bit           _BIT_ACCESS(LCDDATA49,6)
// LCDDATA57<S14C7>
extern volatile __bit                   S14C7               __at(0x763E);	// @ (0xEC7 * 8 + 6)
#define                                 S14C7_bit           _BIT_ACCESS(LCDDATA57,6)
// LCDDATA1<S15C0>
extern volatile __bit                   S15C0               __at(0x747F);	// @ (0xE8F * 8 + 7)
#define                                 S15C0_bit           _BIT_ACCESS(LCDDATA1,7)
// LCDDATA9<S15C1>
extern volatile __bit                   S15C1               __at(0x74BF);	// @ (0xE97 * 8 + 7)
#define                                 S15C1_bit           _BIT_ACCESS(LCDDATA9,7)
// LCDDATA17<S15C2>
extern volatile __bit                   S15C2               __at(0x74FF);	// @ (0xE9F * 8 + 7)
#define                                 S15C2_bit           _BIT_ACCESS(LCDDATA17,7)
// LCDDATA25<S15C3>
extern volatile __bit                   S15C3               __at(0x753F);	// @ (0xEA7 * 8 + 7)
#define                                 S15C3_bit           _BIT_ACCESS(LCDDATA25,7)
// LCDDATA33<S15C4>
extern volatile __bit                   S15C4               __at(0x757F);	// @ (0xEAF * 8 + 7)
#define                                 S15C4_bit           _BIT_ACCESS(LCDDATA33,7)
// LCDDATA41<S15C5>
extern volatile __bit                   S15C5               __at(0x75BF);	// @ (0xEB7 * 8 + 7)
#define                                 S15C5_bit           _BIT_ACCESS(LCDDATA41,7)
// LCDDATA49<S15C6>
extern volatile __bit                   S15C6               __at(0x75FF);	// @ (0xEBF * 8 + 7)
#define                                 S15C6_bit           _BIT_ACCESS(LCDDATA49,7)
// LCDDATA57<S15C7>
extern volatile __bit                   S15C7               __at(0x763F);	// @ (0xEC7 * 8 + 7)
#define                                 S15C7_bit           _BIT_ACCESS(LCDDATA57,7)
// LCDDATA2<S16C0>
extern volatile __bit                   S16C0               __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 S16C0_bit           _BIT_ACCESS(LCDDATA2,0)
// LCDDATA10<S16C1>
extern volatile __bit                   S16C1               __at(0x74C0);	// @ (0xE98 * 8 + 0)
#define                                 S16C1_bit           _BIT_ACCESS(LCDDATA10,0)
// LCDDATA18<S16C2>
extern volatile __bit                   S16C2               __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 S16C2_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA26<S16C3>
extern volatile __bit                   S16C3               __at(0x7540);	// @ (0xEA8 * 8 + 0)
#define                                 S16C3_bit           _BIT_ACCESS(LCDDATA26,0)
// LCDDATA34<S16C4>
extern volatile __bit                   S16C4               __at(0x7580);	// @ (0xEB0 * 8 + 0)
#define                                 S16C4_bit           _BIT_ACCESS(LCDDATA34,0)
// LCDDATA42<S16C5>
extern volatile __bit                   S16C5               __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 S16C5_bit           _BIT_ACCESS(LCDDATA42,0)
// LCDDATA50<S16C6>
extern volatile __bit                   S16C6               __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 S16C6_bit           _BIT_ACCESS(LCDDATA50,0)
// LCDDATA58<S16C7>
extern volatile __bit                   S16C7               __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 S16C7_bit           _BIT_ACCESS(LCDDATA58,0)
// LCDDATA2<S17C0>
extern volatile __bit                   S17C0               __at(0x7481);	// @ (0xE90 * 8 + 1)
#define                                 S17C0_bit           _BIT_ACCESS(LCDDATA2,1)
// LCDDATA10<S17C1>
extern volatile __bit                   S17C1               __at(0x74C1);	// @ (0xE98 * 8 + 1)
#define                                 S17C1_bit           _BIT_ACCESS(LCDDATA10,1)
// LCDDATA18<S17C2>
extern volatile __bit                   S17C2               __at(0x7501);	// @ (0xEA0 * 8 + 1)
#define                                 S17C2_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA26<S17C3>
extern volatile __bit                   S17C3               __at(0x7541);	// @ (0xEA8 * 8 + 1)
#define                                 S17C3_bit           _BIT_ACCESS(LCDDATA26,1)
// LCDDATA34<S17C4>
extern volatile __bit                   S17C4               __at(0x7581);	// @ (0xEB0 * 8 + 1)
#define                                 S17C4_bit           _BIT_ACCESS(LCDDATA34,1)
// LCDDATA42<S17C5>
extern volatile __bit                   S17C5               __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 S17C5_bit           _BIT_ACCESS(LCDDATA42,1)
// LCDDATA50<S17C6>
extern volatile __bit                   S17C6               __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 S17C6_bit           _BIT_ACCESS(LCDDATA50,1)
// LCDDATA58<S17C7>
extern volatile __bit                   S17C7               __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 S17C7_bit           _BIT_ACCESS(LCDDATA58,1)
// LCDDATA2<S18C0>
extern volatile __bit                   S18C0               __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 S18C0_bit           _BIT_ACCESS(LCDDATA2,2)
// LCDDATA10<S18C1>
extern volatile __bit                   S18C1               __at(0x74C2);	// @ (0xE98 * 8 + 2)
#define                                 S18C1_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA18<S18C2>
extern volatile __bit                   S18C2               __at(0x7502);	// @ (0xEA0 * 8 + 2)
#define                                 S18C2_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA26<S18C3>
extern volatile __bit                   S18C3               __at(0x7542);	// @ (0xEA8 * 8 + 2)
#define                                 S18C3_bit           _BIT_ACCESS(LCDDATA26,2)
// LCDDATA34<S18C4>
extern volatile __bit                   S18C4               __at(0x7582);	// @ (0xEB0 * 8 + 2)
#define                                 S18C4_bit           _BIT_ACCESS(LCDDATA34,2)
// LCDDATA42<S18C5>
extern volatile __bit                   S18C5               __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 S18C5_bit           _BIT_ACCESS(LCDDATA42,2)
// LCDDATA50<S18C6>
extern volatile __bit                   S18C6               __at(0x7602);	// @ (0xEC0 * 8 + 2)
#define                                 S18C6_bit           _BIT_ACCESS(LCDDATA50,2)
// LCDDATA58<S18C7>
extern volatile __bit                   S18C7               __at(0x7642);	// @ (0xEC8 * 8 + 2)
#define                                 S18C7_bit           _BIT_ACCESS(LCDDATA58,2)
// LCDDATA2<S19C0>
extern volatile __bit                   S19C0               __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 S19C0_bit           _BIT_ACCESS(LCDDATA2,3)
// LCDDATA10<S19C1>
extern volatile __bit                   S19C1               __at(0x74C3);	// @ (0xE98 * 8 + 3)
#define                                 S19C1_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA18<S19C2>
extern volatile __bit                   S19C2               __at(0x7503);	// @ (0xEA0 * 8 + 3)
#define                                 S19C2_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA26<S19C3>
extern volatile __bit                   S19C3               __at(0x7543);	// @ (0xEA8 * 8 + 3)
#define                                 S19C3_bit           _BIT_ACCESS(LCDDATA26,3)
// LCDDATA34<S19C4>
extern volatile __bit                   S19C4               __at(0x7583);	// @ (0xEB0 * 8 + 3)
#define                                 S19C4_bit           _BIT_ACCESS(LCDDATA34,3)
// LCDDATA42<S19C5>
extern volatile __bit                   S19C5               __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 S19C5_bit           _BIT_ACCESS(LCDDATA42,3)
// LCDDATA50<S19C6>
extern volatile __bit                   S19C6               __at(0x7603);	// @ (0xEC0 * 8 + 3)
#define                                 S19C6_bit           _BIT_ACCESS(LCDDATA50,3)
// LCDDATA58<S19C7>
extern volatile __bit                   S19C7               __at(0x7643);	// @ (0xEC8 * 8 + 3)
#define                                 S19C7_bit           _BIT_ACCESS(LCDDATA58,3)
// LCDDATA2<S20C0>
extern volatile __bit                   S20C0               __at(0x7484);	// @ (0xE90 * 8 + 4)
#define                                 S20C0_bit           _BIT_ACCESS(LCDDATA2,4)
// LCDDATA10<S20C1>
extern volatile __bit                   S20C1               __at(0x74C4);	// @ (0xE98 * 8 + 4)
#define                                 S20C1_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA18<S20C2>
extern volatile __bit                   S20C2               __at(0x7504);	// @ (0xEA0 * 8 + 4)
#define                                 S20C2_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA26<S20C3>
extern volatile __bit                   S20C3               __at(0x7544);	// @ (0xEA8 * 8 + 4)
#define                                 S20C3_bit           _BIT_ACCESS(LCDDATA26,4)
// LCDDATA34<S20C4>
extern volatile __bit                   S20C4               __at(0x7584);	// @ (0xEB0 * 8 + 4)
#define                                 S20C4_bit           _BIT_ACCESS(LCDDATA34,4)
// LCDDATA42<S20C5>
extern volatile __bit                   S20C5               __at(0x75C4);	// @ (0xEB8 * 8 + 4)
#define                                 S20C5_bit           _BIT_ACCESS(LCDDATA42,4)
// LCDDATA50<S20C6>
extern volatile __bit                   S20C6               __at(0x7604);	// @ (0xEC0 * 8 + 4)
#define                                 S20C6_bit           _BIT_ACCESS(LCDDATA50,4)
// LCDDATA58<S20C7>
extern volatile __bit                   S20C7               __at(0x7644);	// @ (0xEC8 * 8 + 4)
#define                                 S20C7_bit           _BIT_ACCESS(LCDDATA58,4)
// LCDDATA2<S21C0>
extern volatile __bit                   S21C0               __at(0x7485);	// @ (0xE90 * 8 + 5)
#define                                 S21C0_bit           _BIT_ACCESS(LCDDATA2,5)
// LCDDATA10<S21C1>
extern volatile __bit                   S21C1               __at(0x74C5);	// @ (0xE98 * 8 + 5)
#define                                 S21C1_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA18<S21C2>
extern volatile __bit                   S21C2               __at(0x7505);	// @ (0xEA0 * 8 + 5)
#define                                 S21C2_bit           _BIT_ACCESS(LCDDATA18,5)
// LCDDATA26<S21C3>
extern volatile __bit                   S21C3               __at(0x7545);	// @ (0xEA8 * 8 + 5)
#define                                 S21C3_bit           _BIT_ACCESS(LCDDATA26,5)
// LCDDATA34<S21C4>
extern volatile __bit                   S21C4               __at(0x7585);	// @ (0xEB0 * 8 + 5)
#define                                 S21C4_bit           _BIT_ACCESS(LCDDATA34,5)
// LCDDATA42<S21C5>
extern volatile __bit                   S21C5               __at(0x75C5);	// @ (0xEB8 * 8 + 5)
#define                                 S21C5_bit           _BIT_ACCESS(LCDDATA42,5)
// LCDDATA50<S21C6>
extern volatile __bit                   S21C6               __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 S21C6_bit           _BIT_ACCESS(LCDDATA50,5)
// LCDDATA58<S21C7>
extern volatile __bit                   S21C7               __at(0x7645);	// @ (0xEC8 * 8 + 5)
#define                                 S21C7_bit           _BIT_ACCESS(LCDDATA58,5)
// LCDDATA2<S22C0>
extern volatile __bit                   S22C0               __at(0x7486);	// @ (0xE90 * 8 + 6)
#define                                 S22C0_bit           _BIT_ACCESS(LCDDATA2,6)
// LCDDATA10<S22C1>
extern volatile __bit                   S22C1               __at(0x74C6);	// @ (0xE98 * 8 + 6)
#define                                 S22C1_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA18<S22C2>
extern volatile __bit                   S22C2               __at(0x7506);	// @ (0xEA0 * 8 + 6)
#define                                 S22C2_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA26<S22C3>
extern volatile __bit                   S22C3               __at(0x7546);	// @ (0xEA8 * 8 + 6)
#define                                 S22C3_bit           _BIT_ACCESS(LCDDATA26,6)
// LCDDATA34<S22C4>
extern volatile __bit                   S22C4               __at(0x7586);	// @ (0xEB0 * 8 + 6)
#define                                 S22C4_bit           _BIT_ACCESS(LCDDATA34,6)
// LCDDATA42<S22C5>
extern volatile __bit                   S22C5               __at(0x75C6);	// @ (0xEB8 * 8 + 6)
#define                                 S22C5_bit           _BIT_ACCESS(LCDDATA42,6)
// LCDDATA50<S22C6>
extern volatile __bit                   S22C6               __at(0x7606);	// @ (0xEC0 * 8 + 6)
#define                                 S22C6_bit           _BIT_ACCESS(LCDDATA50,6)
// LCDDATA58<S22C7>
extern volatile __bit                   S22C7               __at(0x7646);	// @ (0xEC8 * 8 + 6)
#define                                 S22C7_bit           _BIT_ACCESS(LCDDATA58,6)
// LCDDATA2<S23C0>
extern volatile __bit                   S23C0               __at(0x7487);	// @ (0xE90 * 8 + 7)
#define                                 S23C0_bit           _BIT_ACCESS(LCDDATA2,7)
// LCDDATA10<S23C1>
extern volatile __bit                   S23C1               __at(0x74C7);	// @ (0xE98 * 8 + 7)
#define                                 S23C1_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA18<S23C2>
extern volatile __bit                   S23C2               __at(0x7507);	// @ (0xEA0 * 8 + 7)
#define                                 S23C2_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA26<S23C3>
extern volatile __bit                   S23C3               __at(0x7547);	// @ (0xEA8 * 8 + 7)
#define                                 S23C3_bit           _BIT_ACCESS(LCDDATA26,7)
// LCDDATA34<S23C4>
extern volatile __bit                   S23C4               __at(0x7587);	// @ (0xEB0 * 8 + 7)
#define                                 S23C4_bit           _BIT_ACCESS(LCDDATA34,7)
// LCDDATA42<S23C5>
extern volatile __bit                   S23C5               __at(0x75C7);	// @ (0xEB8 * 8 + 7)
#define                                 S23C5_bit           _BIT_ACCESS(LCDDATA42,7)
// LCDDATA50<S23C6>
extern volatile __bit                   S23C6               __at(0x7607);	// @ (0xEC0 * 8 + 7)
#define                                 S23C6_bit           _BIT_ACCESS(LCDDATA50,7)
// LCDDATA58<S23C7>
extern volatile __bit                   S23C7               __at(0x7647);	// @ (0xEC8 * 8 + 7)
#define                                 S23C7_bit           _BIT_ACCESS(LCDDATA58,7)
// LCDDATA3<S24C0>
extern volatile __bit                   S24C0               __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 S24C0_bit           _BIT_ACCESS(LCDDATA3,0)
// LCDDATA11<S24C1>
extern volatile __bit                   S24C1               __at(0x74C8);	// @ (0xE99 * 8 + 0)
#define                                 S24C1_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA19<S24C2>
extern volatile __bit                   S24C2               __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 S24C2_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA27<S24C3>
extern volatile __bit                   S24C3               __at(0x7548);	// @ (0xEA9 * 8 + 0)
#define                                 S24C3_bit           _BIT_ACCESS(LCDDATA27,0)
// LCDDATA35<S24C4>
extern volatile __bit                   S24C4               __at(0x7588);	// @ (0xEB1 * 8 + 0)
#define                                 S24C4_bit           _BIT_ACCESS(LCDDATA35,0)
// LCDDATA43<S24C5>
extern volatile __bit                   S24C5               __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 S24C5_bit           _BIT_ACCESS(LCDDATA43,0)
// LCDDATA51<S24C6>
extern volatile __bit                   S24C6               __at(0x7608);	// @ (0xEC1 * 8 + 0)
#define                                 S24C6_bit           _BIT_ACCESS(LCDDATA51,0)
// LCDDATA59<S24C7>
extern volatile __bit                   S24C7               __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 S24C7_bit           _BIT_ACCESS(LCDDATA59,0)
// LCDDATA3<S25C0>
extern volatile __bit                   S25C0               __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 S25C0_bit           _BIT_ACCESS(LCDDATA3,1)
// LCDDATA11<S25C1>
extern volatile __bit                   S25C1               __at(0x74C9);	// @ (0xE99 * 8 + 1)
#define                                 S25C1_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA19<S25C2>
extern volatile __bit                   S25C2               __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 S25C2_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA27<S25C3>
extern volatile __bit                   S25C3               __at(0x7549);	// @ (0xEA9 * 8 + 1)
#define                                 S25C3_bit           _BIT_ACCESS(LCDDATA27,1)
// LCDDATA35<S25C4>
extern volatile __bit                   S25C4               __at(0x7589);	// @ (0xEB1 * 8 + 1)
#define                                 S25C4_bit           _BIT_ACCESS(LCDDATA35,1)
// LCDDATA43<S25C5>
extern volatile __bit                   S25C5               __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 S25C5_bit           _BIT_ACCESS(LCDDATA43,1)
// LCDDATA51<S25C6>
extern volatile __bit                   S25C6               __at(0x7609);	// @ (0xEC1 * 8 + 1)
#define                                 S25C6_bit           _BIT_ACCESS(LCDDATA51,1)
// LCDDATA59<S25C7>
extern volatile __bit                   S25C7               __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 S25C7_bit           _BIT_ACCESS(LCDDATA59,1)
// LCDDATA3<S26C0>
extern volatile __bit                   S26C0               __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 S26C0_bit           _BIT_ACCESS(LCDDATA3,2)
// LCDDATA11<S26C1>
extern volatile __bit                   S26C1               __at(0x74CA);	// @ (0xE99 * 8 + 2)
#define                                 S26C1_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA19<S26C2>
extern volatile __bit                   S26C2               __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 S26C2_bit           _BIT_ACCESS(LCDDATA19,2)
// LCDDATA27<S26C3>
extern volatile __bit                   S26C3               __at(0x754A);	// @ (0xEA9 * 8 + 2)
#define                                 S26C3_bit           _BIT_ACCESS(LCDDATA27,2)
// LCDDATA35<S26C4>
extern volatile __bit                   S26C4               __at(0x758A);	// @ (0xEB1 * 8 + 2)
#define                                 S26C4_bit           _BIT_ACCESS(LCDDATA35,2)
// LCDDATA43<S26C5>
extern volatile __bit                   S26C5               __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 S26C5_bit           _BIT_ACCESS(LCDDATA43,2)
// LCDDATA51<S26C6>
extern volatile __bit                   S26C6               __at(0x760A);	// @ (0xEC1 * 8 + 2)
#define                                 S26C6_bit           _BIT_ACCESS(LCDDATA51,2)
// LCDDATA59<S26C7>
extern volatile __bit                   S26C7               __at(0x764A);	// @ (0xEC9 * 8 + 2)
#define                                 S26C7_bit           _BIT_ACCESS(LCDDATA59,2)
// LCDDATA3<S27C0>
extern volatile __bit                   S27C0               __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 S27C0_bit           _BIT_ACCESS(LCDDATA3,3)
// LCDDATA11<S27C1>
extern volatile __bit                   S27C1               __at(0x74CB);	// @ (0xE99 * 8 + 3)
#define                                 S27C1_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA19<S27C2>
extern volatile __bit                   S27C2               __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 S27C2_bit           _BIT_ACCESS(LCDDATA19,3)
// LCDDATA27<S27C3>
extern volatile __bit                   S27C3               __at(0x754B);	// @ (0xEA9 * 8 + 3)
#define                                 S27C3_bit           _BIT_ACCESS(LCDDATA27,3)
// LCDDATA35<S27C4>
extern volatile __bit                   S27C4               __at(0x758B);	// @ (0xEB1 * 8 + 3)
#define                                 S27C4_bit           _BIT_ACCESS(LCDDATA35,3)
// LCDDATA43<S27C5>
extern volatile __bit                   S27C5               __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 S27C5_bit           _BIT_ACCESS(LCDDATA43,3)
// LCDDATA51<S27C6>
extern volatile __bit                   S27C6               __at(0x760B);	// @ (0xEC1 * 8 + 3)
#define                                 S27C6_bit           _BIT_ACCESS(LCDDATA51,3)
// LCDDATA59<S27C7>
extern volatile __bit                   S27C7               __at(0x764B);	// @ (0xEC9 * 8 + 3)
#define                                 S27C7_bit           _BIT_ACCESS(LCDDATA59,3)
// LCDDATA3<S28C0>
extern volatile __bit                   S28C0               __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 S28C0_bit           _BIT_ACCESS(LCDDATA3,4)
// LCDDATA11<S28C1>
extern volatile __bit                   S28C1               __at(0x74CC);	// @ (0xE99 * 8 + 4)
#define                                 S28C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA19<S28C2>
extern volatile __bit                   S28C2               __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 S28C2_bit           _BIT_ACCESS(LCDDATA19,4)
// LCDDATA27<S28C3>
extern volatile __bit                   S28C3               __at(0x754C);	// @ (0xEA9 * 8 + 4)
#define                                 S28C3_bit           _BIT_ACCESS(LCDDATA27,4)
// LCDDATA35<S28C4>
extern volatile __bit                   S28C4               __at(0x758C);	// @ (0xEB1 * 8 + 4)
#define                                 S28C4_bit           _BIT_ACCESS(LCDDATA35,4)
// LCDDATA43<S28C5>
extern volatile __bit                   S28C5               __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 S28C5_bit           _BIT_ACCESS(LCDDATA43,4)
// LCDDATA51<S28C6>
extern volatile __bit                   S28C6               __at(0x760C);	// @ (0xEC1 * 8 + 4)
#define                                 S28C6_bit           _BIT_ACCESS(LCDDATA51,4)
// LCDDATA59<S28C7>
extern volatile __bit                   S28C7               __at(0x764C);	// @ (0xEC9 * 8 + 4)
#define                                 S28C7_bit           _BIT_ACCESS(LCDDATA59,4)
// LCDDATA3<S29C0>
extern volatile __bit                   S29C0               __at(0x748D);	// @ (0xE91 * 8 + 5)
#define                                 S29C0_bit           _BIT_ACCESS(LCDDATA3,5)
// LCDDATA11<S29C1>
extern volatile __bit                   S29C1               __at(0x74CD);	// @ (0xE99 * 8 + 5)
#define                                 S29C1_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA19<S29C2>
extern volatile __bit                   S29C2               __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA27<S29C3>
extern volatile __bit                   S29C3               __at(0x754D);	// @ (0xEA9 * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA27,5)
// LCDDATA35<S29C4>
